Repository: maffins/Trustcone
Catalog: app/Locale/eng/LC_MESSAGES/*.po
Languages: af_za

source: The status could not be saved. Please, try again.
af_za: Die status kon nie gestoor word nie. Probeer asseblief weer.

source: The status has been deleted.
af_za: Die status is verwyder.

source: The status could not be deleted. Please, try again.
af_za: Die status kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid temporary committee
af_za: Ongeldige tydelike komitee

source: The temporary committee has been saved.
af_za: Die tydelike komitee is gered.

source: The temporary committee could not be saved. Please, try again.
af_za: Die tydelike komitee kon nie gered word nie. Probeer asseblief weer.

source: The temporary committee has been deleted.
af_za: Die tydelike komitee is verwyder.

source: The temporary committee could not be deleted. Please, try again.
af_za: Die tydelike komitee kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid Tourism, environ document
af_za: Ongeldige Toerisme, omgewingsdokument

source: The Tourism, environ document has been saved.
af_za: Die Toerisme, omgewingsdokument is gered.

source: The Tourism, environ document has been deleted.
af_za: Die Toerisme, omgewingsdokument is verwyder.

source: The Tourism, environ document could not be deleted. Please, try again.
af_za: Die Toerisme, omgewingsdokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid user type
af_za: Ongeldige gebruiker tipe

source: The user type has been saved.
af_za: Die mpac dokument is gestoor.

source: The user type could not be saved. Please, try again.
af_za: Die gebruiker tipe kon nie gestoor word nie. Probeer asseblief weer.

source: The user type has been deleted.
af_za: Die gebruiker tipe is verwyder.

source: The user type could not be deleted. Please, try again.
af_za: Die gebruiker tipe kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid username or password, try again
af_za: Ongeldige gebruikersnaam of wagwoord, probeer weer

source: User permission have been set.
af_za: Gebruikers toestemming is ingestel.

source: The user could not be saved. Please, try again.
af_za: Die gebruiker kon nie gestoor word nie. Probeer asseblief weer.

source: Invalid user
af_za: Ongeldige gebruiker

source: The user has been saved.
af_za: Die gebruiker is gestoor.

source: The user details have been saved.
af_za: Die gebruikersbesonderhede is gestoor.

source: The cellnumber on record
af_za: Die selnommer op rekord

source: The email address (
af_za: Die e-pos adres (

source: The reset code (
af_za: Die reset kode (

source: The confirm password does not match the first password.
af_za: Die bevestig wagwoord stem nie ooreen met die eerste wagwoord nie.

source: Your password has been reset successfully, please login.
af_za: Jou wagwoord is suksesvol gereset, login asseblief.

source: The incident has been reported.
af_za: Die vlak is gestoor.

source: The name of a folder can not begin with a period.
af_za: Die naam van ’n gids kan nie met ’n tydperk begin nie.

source: ADHOC COMMITTEE
af_za: ADHOC-KOMITEE

source: Meeting name
af_za: Byeenkoms naam

source: Previous meeting minutes
af_za: Vorige vergadering minute

source: Annexures
af_za: Aanhangsels

source: Separate Covers
af_za: Afsonderlike Covers

source: Upload All Documents
af_za: Laai alle dokumente op

source: Add more documents to:
af_za: Voeg meer dokumente by:

source: Actions
af_za: Aksies

source: Delete
af_za: Verwyder

source: Are you sure you want to delete # %s?
af_za: Is jy seker jy wil #% s uitvee?

source: List Mayco Documents
af_za: Lys Mayco-dokumente

source: List Users
af_za: Lys gebruikers

source: New User
af_za: Ongeldige gebruiker

source: Submit
af_za: Indien

source: New Adhoc Committee
af_za: Nuwe Adhoc Komitee

source: RESEND ADHOC COMMITTEE MESSAGES
af_za: RESESTER ADHOC KOMITEE Boodskappe

source: Message Type (<small>Tick either one or both</small>)
af_za: Boodskap Tipe (<klein> Merk een of albei </ small>)

source: Send Messages
af_za: Stuur boodskappe

source: There is currently no agenda documents
af_za: Daar is tans geen agenda dokumente

source: PREVIOUS MEETING MINUTES
af_za: VORIGE VERGADERINGSTOETTE

source: There are currently no previous minutes documents
af_za: Daar is tans geen vorige minute dokumente nie

source: There are no annexure documents at the moment
af_za: Daar is tans geen bylaes dokumente nie

source: There are no separate covers documents at the moment
af_za: Daar is tans geen aparte dokumente nie

source: ALL MEMBERS OF THE ADHOC COMMITTEE
af_za: ALLE LEDE VAN DIE ADHOC-KOMITEE

source: Add More Members
af_za: Voeg meer lede by

source: Name
af_za: Naam

source: Email
af_za: E-pos

source: Cellnumber
af_za: Selfoonnommer

source: Role
af_za: Rol

source: View
af_za: Beskou

source: Edit
af_za: Wysig

source: Set permissions
af_za: Stel toestemmings

source: AUDIT SECTION 79 COMMITTEE
af_za: OUDITAFDELING 79 KOMITEE

source: New Audit Committee
af_za: Nuwe Ouditkomitee

source: Resend Audit Committee Messages
af_za: Stuur die boodskappe van die ouditkomitee terug

source: All Members of the Audit Committee
af_za: Alle lede van die ouditkomitee

source: Audit Trails
af_za: Ouditpaaie

source: previous
af_za: vorige

source: next
af_za: volgende

source: Audit Trail
af_za: Ouditspoor

source: Event Description
af_za: Gebeurtenis Beskrywing

source: Contents
af_za: Inhoud

source: Created
af_za: Geskep

source: CHAIR OF CHAIRS SECTION 79 COMMITTEE
af_za: VOORSITTER VAN VOORSITTER ARTIKEL 79 KOMITEE

source: New Chair of chairs Committee
af_za: Nuwe voorsitter van voorsitterskomitee

source: CHAIR OF CHAIRS SECTION 79 COMMITTEE RESEND MESSAGES
af_za: VOORSITTER VAN VOORSITTER ARTIKEL 79 KOMITEE RESEND BERICHTEN

source: ALL MEMBERS OF CHAIR OF CHAIRS SECTION 79 COMMITTEE
af_za: ALLE LEDE VAN VOORSITTER VAN VOORSITTE ARTIKEL 79 KOMITEE

source: Add Communication Log
af_za: Voeg kommunikasielogboek by

source: List Communication Logs
af_za: Lys kommunikasie logboeke

source: Admin Add Communication Log
af_za: Admin Voeg kommunikasie log by

source: Admin Edit Communication Log
af_za: Admin Bestuur kommunikasie log

source: Communication Logs
af_za: Kommunikasie Logboeke

source: New Communication Log
af_za: Nuwe kommunikasielogboek

source: Communication Log
af_za: Kommunikasie Log

source: User
af_za: Gebruiker

source: Date Sent
af_za: Datum gestuur

source: COMMUNITY SERVICES SECTION 80 COMMITTEE DOCUMENTS
af_za: GEMEENSKAPSDIENSTE AFDELING 80 KOMITEE DOKUMENTE

source: Edit Section 79 Document
af_za: Wysig afdeling 79 dokument

source: Community services section 80 Committee Documents
af_za: Gemeenskapsdiensafdeling 80 Komitee Dokumente

source: New Community Services Section 80
af_za: Nuwe Gemeenskapsdienste Artikel 80

source: Resend Community services section 80 committee Documents Messages
af_za: Stuur terug na gemeenskapsdiens artikel 80 komitee Dokumente Boodskappe

source: ALL MEMBERS OF THE COMMUNITY SERVICES SECTION 80 COMMITTEE DOCUMENTS
af_za: ALLE LEDE VAN DIE GEMEENSKAPSDIENSTE AFDELING 80 KOMITEE DOKUMENTE

source: COMMUNITY SERVICES SECTION 80 COMMITEE MEETING
af_za: GEMEENSKAPSDIENSTE AFDELING 80 KOMITEEVERGADERING

source: CORPORATE SERVICES SECTION 80 COMMITTEE
af_za: KORPORATIEWE DIENSTE AFDELING 80 KOMITEE

source: CORPORATE SERVICES SECTION 80 COMMITEE
af_za: KORPORATIEWE DIENSTE AFDELING 80 KOMITEE

source: New Corporate Services Section 80
af_za: Nuwe Korporatiewe Dienste Artikel 80

source: Resend CORPORATE SERVICES SECTION 80 COMMITTEE Messages
af_za: Stuur KORPORATIEWE DIENSTE AFDELING 80 KOMITEE Boodskappe

source: ALL MEMBERS OF THE CORPORATE SERVICES SECTION 80 COMMITTEE
af_za: ALLE LEDE VAN DIE KORPORATIEWE DIENSTE AFDELING 80 KOMITEE

source: CAPTURE COUNCIL MEETING DOCUMENTS
af_za: KAPTURE RAADSVERGADERINGSDOKUMENTE

source: Urgent Documents
af_za: Dringende dokumente

source: Reports
af_za: Berigte

source: Settings
af_za: Instellings

source: Official Documents
af_za: Amptelike dokumente

source: Capture Document
af_za: Vang dokument

source: Users
af_za: Gebruikers

source: View Documents by directorates
af_za: Bekyk dokumente deur direktorate

source: Council Documents
af_za: Raad Dokumente

source: MAYCO Documents
af_za: MAYCO Dokumente

source: Capture Documents
af_za: Vang dokumente

source: Fault list
af_za: Fout lys

source: Capture Meeting Minutes
af_za: Vang vergadering minute

source: Upload minutes
af_za: Laai minute op

source: Edit Council Meeting Documents
af_za: Redigeer vergaderingsdokumente van die Raad

source: Council Meetings List
af_za: Raadsvergaderingslys

source: New Council Documents
af_za: Nuwe Raadsdokumente

source: RESEND COUNCIL MEETING MANAGEMENT MESSAGES
af_za: RESEND MEETINGSBESTUURSMEDDELINGS

source: ALL MEMBERS OF THE COUNCIL MEETING DOCUMENTS
af_za: ALLE LEDE VAN DIE RAADSVERGADERINGSDOKUMENTE

source: Admin Add Department
af_za: Admin Voeg Departement by

source: List Departments
af_za: Lys Departemente

source: List Documents
af_za: Lys dokumente

source: New Document
af_za: Nuwe dokument

source: Departments
af_za: Departemente

source: New Department
af_za: Nuwe Departement

source: Modified
af_za: Gewysig

source: Edit Department
af_za: Redigeer Departement

source: Related Documents
af_za: Verwante dokumente

source: User Id
af_za: Gebruiker-ID

source: Related Users
af_za: Verwante gebruikers

source: Telephone
af_za: Telefoon

source: Physical Address
af_za: Fisiese adres

source: Postal Address
af_za: Posadres

source: Documents list
af_za: Dokumente lys

source: DERMACATION SECTION 79 COMMITTEE
af_za: AFBAKENING AFDELING 79 KOMITEE

source: New Dermacation Committee
af_za: Nuwe Afbakeningskomitee

source: RESEND DERMACATION SECTION 79 COMMITTEE MESSAGES
af_za: RESEND AFBAKENING AFDELING 79 KOMITEE Boodskappe

source: ALL MEMBERS OF THE DERMACATION SECTION 79 COMMITTEE
af_za: ALLE LEDE VAN DIE AFBAKENING AFDELING 79 KOMITEE

source: DISPUTE RESOLUTION SECTION 79 COMMITTEE
af_za: BESPROTE RESOLUSIE AFDELING 79 KOMITEE

source: New Dispute Resolution Committee
af_za: Nuwe Dispuut Resolusie Komitee

source: RESEND DISPUTE RESOLUTION SECTION 79 COMMITTEE MESSAGES
af_za: BESPREKINGS BESLUIT RESOLUSIE AFDELING 79 KOMITEE Boodskappe

source: ALL MEMBERS OF THE DISPUTE RESOLUTION SECTION 79 COMMITTEE
af_za: ALLE LEDE VAN DIE DISPUTE RESOLUSIE AFDELING 79 KOMITEE

source: Add Document for signing
af_za: Voeg dokument by vir ondertekening

source: Send Document
af_za: Stuur dokument

source: Documents
af_za: Vang dokumente

source: Document
af_za: Dokument

source: Edit Document
af_za: Redigeer dokument

source: Delete Document
af_za: Vee dokument uit

source: Capture new Document
af_za: Vang nuwe dokument

source: Take Action
af_za: Neem aksie

source: Document owned by
af_za: Dokument besit deur

source: Directory
af_za: Gids

source: Document type <br />(<small>Click on the name to view the attached document</small>)
af_za: Soort dokument <br /> (<small> Klik op die naam om die aangehegte dokument te sien </ small>)

source: Date Compiled
af_za: Datum Opgestel

source: Document Id
af_za: Dokument ID

source: Resend Mayco Messages
af_za: Stuur Mayco Boodskappe weer

source: Compiled by
af_za: Opgestel deur

source: Document type (Click to download)
af_za: Dokument tipe (Klik om af te laai)

source: ALL MEMBERS OF THE OFFICIAL DOCUMENTS
af_za: ALLE LEDE VAN DIE AMPTELIKE DOKUMENTE

source: List Statuses
af_za: Lys Statuses

source: New Status
af_za: Nuwe status

source: List Levels
af_za: Lys vlakke

source: New Level
af_za: Nuwe vlak

source: Documents Trackers
af_za: Dokumente Trackers

source: Updated By
af_za: Opgedateer deur

source: Brought By
af_za: Aangebied

source: Date Brought
af_za: Datum gebring

source: Date Updated
af_za: Datum Opgedateer

source: SECTION 80 MEETING DOCUMENTS
af_za: AFDELING 80 VERGADERINGSDOKUMENTE

source: Joint Section 80 Committee: LED, Tourism & Human Settlement Commitee Documents
af_za: Gesamentlike Artikel 80 Komitee: Dokumente van LED, Toerisme en Menslike Nedersetting

source: LED, Tourism & Human Settlement Commitee
af_za: LED, Toerisme en Menslike Nedersettingskomitee

source: RESEND SECTION 80 MEETING DOCUMENTS MESSAGES
af_za: LEES AFDELING 80 VERGADERINGSDOKUMENTE Boodskappe

source: ALL MEMBERS OF THE SECTION 80 MEETING DOCUMENTS
af_za: ALLE LEDE VAN DIE AFDELING 80 VERGADERINGSDOKUMENTE

source: Joint Section 80 Committee: LED, Tourism & Human Settlement Committee
af_za: Gesamentlike Artikel 80 Komitee: LED, Toerisme en Menslike Nedersettingskomitee

source: OFFICIAL DOCUMENTS
af_za: AMPTELIKE DOKUMENTE

source: COUNCIL DOCUMENTS
af_za: RAAD DOKUMENTE

source: EXCO DOCUMENTS
af_za: EXCO DOKUMENTE

source: Finance Committee
af_za: Finansies Komitee

source: Infrastructure & Technical Services Committee
af_za: Infrastruktuur en Tegniese Dienste Komitee

source: Community Services Section 80 Committee
af_za: Gemeenskapsdienste Artikel 80 Komitee

source: Public Safety Committee
af_za: Openbare Veiligheidskomitee

source: Joint Section 80 Committee: LED, Tourism & Human Settlement
af_za: Gesamentlike Artikel 80 Komitee: LED, Toerisme & Menslike Nedersetting

source: Sports, Arts & Culture Committee
af_za: Sport-, Kuns- en Kultuurkomitee

source: Corporate Services Section 80 Committee
af_za: Korporatiewe Dienste Artikel 80 Komitee

source: IDP, Policy, Monitoring & Evaluation Committee
af_za: GOP, beleid, monitering en evalueringskomitee

source: LED, SMALL BUSINESS, SPATIAL PLANNING AND LAND USE MANAGEMENT
af_za: LED, KLEIN BESIGHEID, RUIMTELIKE BEPLANNING EN GRONDGEBRUIKBESTUUR

source: HUMAN SETTLEMENT COMMITEE
af_za: MENSVERSLAGKOMITEE

source: TOURISM, ENVIRONMENT AFFAIRS AND AGRICULTURE COMMITEE
af_za: TOERISME, OMGEWINGSAKE EN LANDBOUWKOMITEE

source: MPAC Committee
af_za: MPAC Komitee

source: Dispute Resolution Committee
af_za: Dispuut Resolusie Komitee

source: Rules Committee
af_za: Reglementskomitee

source: Chair of Chairs
af_za: Voorsitter van Stoele

source: Political Steering Committee
af_za: Politieke Bestuurskomitee

source: Dermacation Committee
af_za: Afbakeningskomitee

source: Revenue Enhancement
af_za: Inkomsteverbetering

source: Audit Committee
af_za: Oudit komitee

source: LLF MEETING DOCUMENTS
af_za: LLF VERGADERINGSDOKUMENTE

source: MINUTES
af_za: MINUTE

source: USERS
af_za: VERBRUIKERS

source: SECTION 80 COMMITTEES MEETING DOCUMENTS
af_za: AFDELING 80 KOMITEES VERGADERINGSDOKUMENTE

source: Led, Small Business, Spatial Planning and Land Use Management
af_za: Gelei, Klein Besigheid, Ruimtelike Beplanning en Grondgebruikbestuur

source: Human Settlement Committee
af_za: Menslike Nedersettingskomitee

source: Tourism, Environment Affairs and Agriculture Committee
af_za: Toerisme, Omgewingsake en Landbou Komitee

source: SECTION 79 COMMITTEES MEETING DOCUMENTS
af_za: AFDELING 79 KOMITEESVERGADERING DOKUMENTE

source: Chair of Chairs Committee
af_za: Voorsitter van die Stoele Komitee

source: Revenue Enhancement Committee
af_za: Inkomsteverbeteringskomitee

source: TEMPORARY COMMITTEES
af_za: TYDELIKE KOMITEES

source: ADHOC Committee
af_za: ADHOC Komitee

source: Matjhabeng Local Municipality Document Management System
af_za: Matjhabeng Plaaslike Munisipaliteit Dokument Bestuurstelsel

source: Community Services Committee
af_za: Gemeenskapsdienskomitee

source: Corporate Services Committee
af_za: Korporatiewe Dienste Komitee

source: Its been approved and its with the CFO secretary at the moment
af_za: Dit is goedgekeur en dit is tans by die CFO-sekretaresse

source: The following document is being requested
af_za: Die volgende dokument word aangevra

source: Meeting name:
af_za: Byeenkoms naam:

source: Could not download document with name
af_za: Kon nie dokument met naam aflaai nie

source: You can email the document to this email
af_za: U kan die dokument aan hierdie e-pos stuur

source: Fault Reported
af_za: Fout gerapporteer

source: Greetings to you
af_za: Groete aan jou

source: Meeting minutes are posted. Please login to
af_za: Vergaderings minute is gepos. Log asseblief in

source: to view the minutes document
af_za: om die notule dokument te besigtig

source: Username
af_za: Gebruikersnaam

source: Password
af_za: Wagwoord

source: Password reset successfully
af_za: Wagwoord herstel suksesvol

source: Counsilor could not download document
af_za: Berading kon nie dokument aflaai nie

source: Password rest successfull
af_za: Wagwoord herstel suksesvol

source: EXCO MEETING DOCUMENTS
af_za: EXCO VERGADERINGSDOKUMENTE

source: Edit Exco Document
af_za: Wysig Exco-dokument

source: Exco Documents
af_za: Exco Dokumente

source: New EXCO Meeting
af_za: Nuwe EXCO Vergadering

source: RESEND EXCO MEETING DOCUMENTS MESSAGES
af_za: HUUR EXCO VERGADERINGSDOKUMENTE Boodskappe

source: ALL MEMBERS OF THE EXCO MEETING DOCUMENTS
af_za: ALLE LEDE VAN DIE EXCO VERGADERINGSDOKUMENTE

source: Exco Meetings List
af_za: Exco Vergaderings Lys

source: Record Fault
af_za: Teken fout

source: Report fault
af_za: Teken fout

source: Add Comment
af_za: Lewer kommentaar

source: Faults that have been reported
af_za: Foute wat aangemeld is

source: Faults i have reported
af_za: Foute wat ek aangemeld het

source: Capture Fault
af_za: Vang fout

source: Fault
af_za: Fout

source: Assinged
af_za: Opgedra

source: Fault reported by:
af_za: Fout aangemeld deur:

source: Fault Number
af_za: Foutnommer

source: Fault Name
af_za: Foutnaam

source: Town / Township / Ward number / Location
af_za: Dorp / Dorp / Wyknommer / Plek

source: Street Name
af_za: Straat naam

source: Date fault reported
af_za: Datum fout aangemeld

source: Date added
af_za: Datum bygevoeg

source: Comments
af_za: Kommentaar

source: My Comments
af_za: My kommentaar

source: Comment Response
af_za: Reageer Reaksie

source: Mark as completed
af_za: Merk as voltooi

source: Are you sure the fault is now completed # %s?
af_za: Is jy seker die fout is nou voltooi?% S?

source: Add Fault Comment
af_za: Voeg fout kommentaar by

source: Add comment
af_za: Lewer kommentaar

source: Edit Faults Comment
af_za: Wysig foute Kommentaar

source: List Faults Comments
af_za: Lys foute Kommentaar

source: List Faults
af_za: Lys foute

source: <span class="glyphicon glyphicon-edit"></span>&nbsp&nbsp;Edit Faults Comment
af_za: <span class = “glyphicon glyphicon-edit”> </ span> & nbsp & nbsp; wysig foute Kommentaar

source: <span class="glyphicon glyphicon-remove"></span>&nbsp;&nbsp;Delete Faults Comment
af_za: <span class = “glyphicon glyphicon-remove”> </ span> & nbsp; & nbsp; Verwyder foute Kommentaar

source: <span class="glyphicon glyphicon-list"></span>&nbsp&nbsp;List Users
af_za: <span class = “glyphicon glyphicon-list”> </ span> & nbsp & nbsp; lys gebruikers

source: <span class="glyphicon glyphicon-plus"></span>&nbsp&nbsp;New User
af_za: <span class = “glyphicon glyphicon-plus”> </ span> & nbsp & nbsp; Nuwe gebruiker

source: Comment
af_za: Kommentaar

source: Date Responded
af_za: Datum gereageer

source: Document Name
af_za: Dokument Naam

source: Assigned To
af_za: Toevertrou aan

source: Date Actioned
af_za: Datum geaktiveer

source: Date Completed
af_za: Datum voltooi

source: Action Taken
af_za: Aksie geneem

source: FINANCE SECTION 80 COMMITTEE
af_za: FINANSIES AFDELING 80 KOMITEE

source: New Finance Committee
af_za: Nuwe Finansiële Komitee

source: RESEND FINANCE SECTION 80 COMMITTEE MESSAGES
af_za: RESEND FINANSIES AFDELING 80 KOMITEE Boodskappe

source: ALL MEMBERS OF THE FINANCE SECTION 80 COMMITTEE
af_za: ALLE LEDE VAN DIE FINANSIES AFDELING 80 KOMITEE

source: HUMAN SETTLEMENT COMMITEE SECTION 80 COMMITTEE
af_za: MENSVERDELINGKOMITEE ARTIKEL 80

source: IHUMAN SETTLEMENT SECTION 80 COMMITTEE
af_za: MENSLIKE AFWERKING AFDELING 80 KOMITEE

source: New Human Settlement
af_za: Nuwe Menslike Nedersetting

source: RESEND HUMAN SETTLEMENT COMMITEE SECTION 80 COMMITTEE MESSAGES
af_za: RESEND MENSVERDELINGKOMITEE AFDELING 80 KOMITEE Boodskappe

source: ALL MEMBERS OF THE HUMAN SETTLEMENT COMMITEE SECTION 80 COMMITTEE
af_za: ALLE LEDE VAN DIE MENSLIKE VERSLAGKOMITEE AFDELING 80 KOMITEE

source: IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE
af_za: GOP, BELEID, MONITERING EN EVALUERING AFDELING 80 KOMITEE

source: New IDP Polic Services
af_za: Nuwe GOP Polisiedienste

source: RESEND IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE MESSAGES
af_za: RESEND IDP, BELEID, MONITORING & EVALUERING AFDELING 80 KOMITEE Boodskappe

source: ALL MEMBERS OF THE IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE
af_za: ALLE LEDE VAN DIE GOP, BELEID, MONITERING EN EVALUERING AFDELING 80 KOMITEE

source: INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE
af_za: INFRASTRUKTUUR EN TEGNIESE DIENSTE AFDELING 80 KOMITEE

source: New Infrastructure Services
af_za: Nuwe infrastruktuurdienste

source: RESEND INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE MESSAGES
af_za: RESEND INFRASTRUKTUUR EN TEGNIESE DIENSTE AFDELING 80 KOMITEE Boodskappe

source: ALL MEMBERS OF THE INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE
af_za: ALLE LEDE VAN DIE INFRASTRUKTUUR EN TEGNIESE DIENSTE AFDELING 80 KOMITEE

source: LED, SMALL BUSINESS, SPATIAL PLANNING AND LAND USE MANAGEMENT SECTION 80 COMMITTEE
af_za: LED, KLEIN BESIGHEID, RUIMTELIKE BEPLANNING EN GRONDGEBRUIKBESTUUR SEKSIE 80 KOMITEE

source: New LED
af_za: Nuwe LED

source: RESEND LED, SMALL BUSINESS, SPATIAL PLANNING AND LAND USE MANAGEMENT SECTION 80 COMMITTEE MESSAGES
af_za: RESEND LED, KLEIN BESIGHEID, RUIMTELIKE BEPLANNING EN GRONDGEBRUIKBESTUUR AFDELING 80 KOMITEE Boodskappe

source: ALL MEMBERS OF THE LED, SMALL BUSINESS, SPATIAL PLANNING AND LAND USE MANAGEMENT SECTION 80 COMMITTEE
af_za: ALLE LEDE VAN DIE LED, KLEIN BESIGHEID, RUIMTELIKE BEPLANNING EN GRONDGEBRUIKBESTUUR SEKSIE 80 KOMITEE

source: MAYCO MEETING DOCUMENTS
af_za: MAYCO VERGADERINGSDOKUMENTE

source: Edit Mayco Document
af_za: Wysig Mayco-dokument

source: Mayco Documents
af_za: Mayco Dokumente

source: New MAYCO Meeting
af_za: Nuwe MAYCO-vergadering

source: ALL MEMBERS OF THE MAYCO MEETING DOCUMENTS
af_za: ALLE LEDE VAN DIE MAYCO VERGADERINGSDOKUMENTE

source: Mayco Meetings List
af_za: Mayco Vergaderingslys

source: Add Meeting Agenda
af_za: Voeg vergadering agenda by

source: List Meeting Agendas
af_za: Lys Vergadering Agendas

source: List Meetings
af_za: Lys Vergaderings

source: New Meeting
af_za: Nuwe vergadering

source: Edit Meeting Agenda
af_za: Wysig vergadering agenda

source: Meeting Agendas
af_za: Vergaderingsagenda

source: New Meeting Agenda
af_za: Nuwe vergadering agenda

source: Meetings
af_za: Vergaderings

source: Meeting
af_za: Ontmoet

source: Meeting Agenda
af_za: Vergadering Agenda

source: Uploaded)by
af_za: Gelaai) deur

source: Meeting Items
af_za: Edit Meeting Item

source: Add Meeting Minutes for
af_za: Voeg Vergadering Notules vir

source: Add Minutes
af_za: Voeg notules by

source: Meeting Minute
af_za: Vergadering Minuut

source: Meeting Minutes
af_za: Notule van die vergadering

source: Uploaded By
af_za: Opgelaai deur

source: Related Meeting Agendas
af_za: Verwante vergadering agendas

source: Related Meeting Attachments
af_za: Verwante vergadering aanhangsels

source: MPAC SECTION 79 COMMITTEE
af_za: MPAC AFDELING 79 KOMITEE

source: New Mpac Committee
af_za: Nuwe Mpac Komitee

source: RESEND MPAC SECTION 79 COMMITTEE MESSAGES
af_za: RESEND MPAC AFDELING 79 KOMITEE Boodskappe

source: ALL MEMBERS OF THE MPAC SECTION 79 COMMITTEE
af_za: ALLE LEDE VAN DIE MPAC AFDELING 79 KOMITEE

source: CEO Report
af_za: Uitvoerende hoofverslag

source: POLITICAL STEERING SECTION 79 COMMITTEE
af_za: POLITIEKE BESTUURS AFDELING 79 KOMITEE

source: New Political Committee
af_za: Nuwe Politieke Komitee

source: RESEND POLITICAL STEERING SECTION 79 COMMITTEE MESSAGES
af_za: RESEND POLITIEKE BESTUURS AFDELING 79 KOMITEE Boodskappe
