Repository: maffins/Trustcone
Catalog: app/Locale/eng/LC_MESSAGES/*.po
Languages: af_za

source: ALL MEMBERS OF THE POLITICAL STEERING SECTION 79 COMMITTEE
af_za: ALLE LEDE VAN DIE POLITIEKE BESTUURS AFDELING 79 KOMITEE

source: PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE
af_za: OPENBARE VEILIGHEID EN VERVOER AFDELING 80 KOMITEE

source: New Public safity Committee
af_za: Nuwe Openbare Veiligheidskomitee

source: RESEND PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE MESSAGES
af_za: RESEND OPENBARE VEILIGHEID EN VERVOER AFDELING 80 KOMITEE Boodskappe

source: ALL MEMBERS OF THE PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE
af_za: ALLE LEDE VAN DIE OPENBARE VEILIGHEID EN VERVOER AFDELING 80 KOMITEE

source: REVENUE ENHANCEMENT SECTION 79 COMMITTEE
af_za: INKOMSTEVERBETERING AFDELING 79 KOMITEE

source: New Revenue Committee
af_za: Nuwe Inkomstekomitee

source: RESEND REVENUE ENHANCEMENT SECTION 79 COMMITTEE MESSAGES
af_za: RESENDE VERBETERING AFDELING 79 KOMITEE Boodskappe

source: ALL MEMBERS OF THE REVENUE ENHANCEMENT SECTION 79 COMMITTEE
af_za: ALLE LEDE VAN DIE INKOMSTEVERBETERING AFDELING 79 KOMITEE

source: RULES SECTION 79 COMMITTEE
af_za: REËLS AFDELING 79 KOMITEE

source: New Rules Committee
af_za: Nuwe Reëls Komitee

source: RESEND RULES SECTION 79 COMMITTEE MESSAGES
af_za: RESENDREËLS AFDELING 79 KOMITEE Boodskappe

source: ALL MEMBERS OF THE RULES SECTION 79 COMMITTEE
af_za: ALLE LEDE VAN DIE REËLS ARTIKEL 79 KOMITEE

source: Mayco Meeting Documents
af_za: Mayco vergaderingsdokumente

source: Capture Official Document
af_za: Vang amptelike dokument

source: New Council Meeting
af_za: Nuwe Raadsvergadering

source: SPORT, ARTS & CULTURE SECTION 80 COMMITTEE
af_za: SPORT-, KUNS- EN KULTUURAFDELING 80 KOMITEE

source: New Sports,Art,Culture Services
af_za: Nuwe Sport-, Kuns-, Kultuurdienste

source: RESEND SPORT, ARTS & CULTURE SECTION 80 COMMITTEE MESSAGES
af_za: RESEND SPORT, KUNS EN KULTUUR AFDELING 80 KOMITEE Boodskappe

source: ALL MEMBERS OF THE SPORT, ARTS & CULTURE SECTION 80 COMMITTEE
af_za: ALLE LEDE VAN DIE SPORT-, KUNS- EN KULTUURAFDELING 80 KOMITEE

source: TOURISM, ENVIRONMENT AFFAIRS AND AGRICULTURE SECTION 80 COMMITTEE
af_za: TOERISME, OMGEWINGSAKE EN LANDBOUW AFDELING 80 KOMITEE

source: New Tourism
af_za: Nuwe Toerisme

source: RESEND TOURISM, ENVIRONMENT AFFAIRS AND AGRICULTURE SECTION 80 COMMITTEE MESSAGES
af_za: RESEND TOERISME, OMGEWINGSAKE EN LANDBOUW AFDELING 80 KOMITEE Boodskappe

source: ALL MEMBERS OF THE TOURISM, ENVIRONMENT AFFAIRS AND AGRICULTURE SECTION 80 COMMITTEE
af_za: ALLE LEDE VAN DIE TOERISME, OMGEWINGSAKE EN LANDBOU DEEL 80 KOMITEE

source: Add User
af_za: Voeg gebruiker by

source: Create User
af_za: Skep gebruiker

source: AUDIT TRAIL
af_za: OUDITSPOOR

source: Save Changes
af_za: Stoor veranderinge

source: Have you forgotten your password
af_za: Het jy jou wagwoord vergeet

source: Click here
af_za: Klik hier

source: My profile
af_za: My profiel

source: First Name
af_za: Eerste naam

source: Surname
af_za: Van

source: Please enter the new password (at least 8 characters and use a combination of uppercase and lower case letters)
af_za: Voer asseblief die nuwe wagwoord in (minstens 8 karakters en gebruik ’n kombinasie van hoofletters en kleinletters)

source: Set Permision for
af_za: Stel Toestemming vir

source: Capture Minutes
af_za: Vang notules

source: Set Permissions
af_za: Stel toestemmings

source: Please enter the code that has been sent to your number
af_za: Voer asseblief die kode in wat na jou nommer gestuur is
