Repository: maffins/Trustcone
Catalog: app/Locale/eng/LC_MESSAGES/*.po
Languages: af_za

source: Invalid meeting
af_za: Ongeldige vergadering

source: Uploaded successfuly.
af_za: Opgelaai suksesvol.

source: Invalid mpac document
af_za: Ongeldige mpac dokument

source: The mpac document has been saved.
af_za: Die mpac dokument is gestoor.

source: The mpac document could not be saved. Please, try again.
af_za: Die mpac-dokument kon nie gestoor word nie. Probeer asseblief weer.

source: The mpac document has been deleted.
af_za: Die mpac dokument is verwyder.

source: The mpac document could not be deleted. Please, try again.
af_za: Die mpac-dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Added documents to meeting successfuly.
af_za: Bygevoeg dokumente om suksesvol te ontmoet.

source: Your messages have been sent.
af_za: Jou boodskappe is gestuur.

source: Invalid Audit Committee document
af_za: Ongeldige ouditkomitee dokument

source: The Audit Committee document has been saved.
af_za: Die ouditkomitee dokument is gered.

source: The Audit Committee document could not be saved. Please, try again.
af_za: Die ouditkomitee-dokument kon nie gered word nie. Probeer asseblief weer.

source: The Audit Committee document has been deleted.
af_za: Die ouditkomitee se dokument is weggelaat.

source: The Audit Committee document could not be deleted. Please, try again.
af_za: Die ouditkomitee-dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid audit trail
af_za: Ongeldige ouditroete

source: The audit trail has been saved.
af_za: Die ouditroete is gered.

source: The audit trail could not be saved. Please, try again.
af_za: Die ouditspoor kon nie gered word nie. Probeer asseblief weer.

source: The audit trail has been deleted.
af_za: Die ouditspoor is verwyder.

source: The audit trail could not be deleted. Please, try again.
af_za: Die ouditspoor kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid CHAIR OF CHAIRS document
af_za: Ongeldige VOORSITTER VAN VOORSITTER-dokument

source: The CHAIR OF CHAIRS document has been saved.
af_za: Die VOORSITTER VAN VOORSITTER-dokument is gestoor.

source: The CHAIR OF CHAIRS document could not be saved. Please, try again.
af_za: Die STAAT VAN VOORSITTER-dokumente kon nie gered word nie. Probeer asseblief weer.

source: The CHAIR OF CHAIRS document has been deleted.
af_za: Die VOORSITTER VAN VOORSITTER-dokument is uitgevee.

source: The CHAIR OF CHAIRS document could not be deleted. Please, try again.
af_za: Die STAAT VAN VOORSITTER-dokumente kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid communication log
af_za: Ongeldige kommunikasie log

source: The communication log has been saved.
af_za: Die kommunikasie log is gestoor.

source: The communication log could not be saved. Please, try again.
af_za: Die kommunikasie-log kon nie gestoor word nie. Probeer asseblief weer.

source: The communication log has been deleted.
af_za: Die kommunikasie-log is verwyder.

source: The communication log could not be deleted. Please, try again.
af_za: Die kommunikasie-log kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid Community Service Section 80 document
af_za: Ongeldige gemeenskapsdiensafdeling 80 dokument

source: The Community Service Section 80 document has been saved.
af_za: Die gemeenskapsdiens artikel 80-dokument is gestoor.

source: The Community Service Section 80 document could not be saved. Please, try again.
af_za: Die Gemeenskapsdiens artikel 80-dokument kon nie gestoor word nie. Probeer asseblief weer.

source: The Community Service Section 80 document has been deleted.
af_za: Die Gemeenskapsdiens artikel 80 dokument is verwyder.

source: The Community Service Section 80 document could not be deleted. Please, try again.
af_za: Die Gemeenskapsdiens artikel 80-dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Added document to meeting successfuly.
af_za: Bygevoeg dokument om suksesvol te ontmoet.

source: Invalid CORPORATE SERVICES COMMITTEE document
af_za: Ongeldige KORPORATIEWE DIENSTEKOMITEE-dokument

source: The CORPORATE SERVICES COMMITTEE document has been saved.
af_za: Die KORPORATIEWE DIENSTEKOMITEE-dokument is gestoor.

source: The CORPORATE SERVICES COMMITTEE document could not be saved. Please, try again.
af_za: Die KORPORATIEWE DIENSTEKOMITEE-dokument kon nie gered word nie. Probeer asseblief weer.

source: The CORPORATE SERVICES COMMITTEE document has been deleted.
af_za: Die KORPORATIEWE DIENSTEKOMITEE-dokument is verwyder.

source: The CORPORATE SERVICES COMMITTEE document could not be deleted. Please, try again.
af_za: Die KORPORATIEWE DIENSTEKOMITEE-dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid counsilor document
af_za: Ongeldige raadslid dokument

source: The counsilor document has been deleted.
af_za: Die raadgewer dokument is verwyder.

source: The counsilor document could not be deleted. Please, try again.
af_za: Die raadslid dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Documents added to meeting successfuly.
af_za: Dokumente is suksesvol bygevoeg.

source: The current meeting have been added successfuly.
af_za: Die huidige vergadering is suksesvol bygevoeg.

source: Invalid cousilor report
af_za: Ongeldige beraderverslag

source: The report has been saved and sent.
af_za: Die verslag is gestoor en gestuur.

source: The cousilor report could not be saved. Please, try again.
af_za: Die beraderverslag kon nie gered word nie. Probeer asseblief weer.

source: The cousilor report has been saved.
af_za: Die beraderverslag is gered.

source: The cousilor report has been deleted.
af_za: Die beraderverslag is uitgevee.

source: The cousilor report could not be deleted. Please, try again.
af_za: Die raadsverslag kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid department
af_za: Ongeldige departement

source: The department has been saved.
af_za: Die departement is gered.

source: The department could not be saved. Please, try again.
af_za: Die departement kon nie gered word nie. Probeer asseblief weer.

source: The department has been deleted.
af_za: Die departement is verwyder.

source: The department could not be deleted. Please, try again.
af_za: Die departement kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid Dermacation Committee document
af_za: Ongeldige afbakeningskomitee dokument

source: The Dermacation Committee document has been saved.
af_za: Die Afbakeningskomitee se dokument is gered.

source: The Dermacation Committee document could not be saved. Please, try again.
af_za: Die Afbakeningskomitee-dokument kon nie gered word nie. Probeer asseblief weer.

source: The Dermacation Committee document has been deleted.
af_za: Die Afbakeningskomitee se dokument is weggelaat.

source: The Dermacation Committee document could not be deleted. Please, try again.
af_za: Die afbakeningskomitee se dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: The document you are requesting for cannot be located
af_za: Die dokument waarna u vra, kan nie gevind word nie

source: Your decision and reason was successfully saved and notification sent.
af_za: Jou besluit en rede is suksesvol gered en kennisgewing gestuur.

source: Invalid document
af_za: Ongeldige dokument

source: The document creation could not continue as the CFO has not been created yet in the system.
af_za: Die skep van dokumente kan nie voortgaan nie aangesien die CFO nog nie in die stelsel geskep is nie.

source: The CFO was not found in the system please contact the administrator.
af_za: Die CFO is nie in die stelsel gevind nie, kontak asseblief die administrateur.

source: The document has been saved.
af_za: Die dokument is gestoor.

source: The document could not be saved. Please, try again.
af_za: Die dokument kon nie gestoor word nie. Probeer asseblief weer.

source: Successfully created a document/s.
af_za: Suksesvol ’n dokuments geskep.

source: Edited successfuly.
af_za: Suksesvol gewysig.

source: The document could not be edited. Please, try again.
af_za: Die dokument kon nie geredigeer word nie. Probeer asseblief weer.

source: The document has been deleted.
af_za: Die dokument is verwyder.

source: The document could not be deleted. Please, try again.
af_za: Die dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid Eighty document
af_za: Ongeldige Eighty dokument

source: The Eighty document has been saved.
af_za: Die Tagtig dokument is gestoor.

source: The Eighty document could not be saved. Please, try again.
af_za: Die agtste dokument kon nie gered word nie. Probeer asseblief weer.

source: The Eighty document has been deleted.
af_za: Die agtste dokument is uitgevee.

source: The Eighty document could not be deleted. Please, try again.
af_za: Die Tagtig dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid exco document
af_za: Ongeldige exco-dokument

source: The exco document has been saved.
af_za: Die exco dokument is gestoor.

source: The exco document could not be saved. Please, try again.
af_za: Die eksco-dokument kon nie gered word nie. Probeer asseblief weer.

source: The exco document has been deleted.
af_za: Die exco dokument is verwyder.

source: The exco document could not be deleted. Please, try again.
af_za: Die eksco-dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Added doucments to meeting successfuly.
af_za: Bygevoeg dokumente om suksesvol te ontmoet.

source: Invalid faults comment
af_za: Ongeldige foute kommentaar

source: The faults comment has been saved and the reporting counsilor has been notified.
af_za: Die fout kommentaar is gered en die verslaggewer berader is in kennis gestel.

source: The faults comment could not be saved. Please, try again.
af_za: Die fout kommentaar is gestoor en die verslaggewer berader is in kennis gestel.

source: The faults comment has been saved.
af_za: Die fout kommentaar is gestoor.

source: The faults comment has been deleted.
af_za: Die fout kommentaar is verwyder.

source: The faults comment could not be deleted. Please, try again.
af_za: Die foutkommentaar kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid fault
af_za: Ongeldige fout

source: Documents Uploaded successfuly.
af_za: Dokumente suksesvol opgelaai.

source: The fault has been sent.
af_za: Die fout is gestuur.

source: The fault could not be sent. Please, try again.
af_za: Die fout kon nie gestuur word nie. Probeer asseblief weer.

source: The fault has been saved.
af_za: Die fout is gestoor.

source: The fault could not be saved. Please, try again.
af_za: Die fout kon nie gered word nie. Probeer asseblief weer.

source: The fault has been deleted.
af_za: Die fout is verwyder.

source: The fault could not be deleted. Please, try again.
af_za: Die fout kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid faults document
af_za: Ongeldige foute dokument

source: The faults document has been saved.
af_za: Die fout dokument is gestoor.

source: The faults document could not be saved. Please, try again.
af_za: Die fout dokument kon nie gestoor word nie. Probeer asseblief weer.

source: The faults document has been deleted.
af_za: Die fout dokument is verwyder.

source: The faults document could not be deleted. Please, try again.
af_za: Die fout dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid faults response
af_za: Ongeldige foute antwoord

source: The faults response has been saved.
af_za: Die foute reaksie is gered.

source: The faults response could not be saved. Please, try again.
af_za: Die foute reaksie kon nie gered word nie. Probeer asseblief weer.

source: The faults response has been deleted.
af_za: Die foute reaksie is verwyder.

source: The faults response could not be deleted. Please, try again.
af_za: Die foute reaksie kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid FINANCE SECTION 80 COMMITTEE document
af_za: Ongeldige FINANSIËLE AFDELING 80 KOMITEE-dokument

source: The FINANCE SECTION 80 COMMITTEE document has been saved.
af_za: Ongeldige FINANSIËLE AFDELING 80 KOMITEE-dokument.

source: The FINANCE SECTION 80 COMMITTEE document could not be saved. Please, try again.
af_za: Die FINANSIES AFDELING 80 KOMITEE-dokument kon nie gered word nie. Probeer asseblief weer.

source: The FINANCE SECTION 80 COMMITTEE document has been deleted.
af_za: Die FINANSIES AFDELING 80 KOMITEE dokument is verwyder.

source: The FINANCE SECTION 80 COMMITTEE document could not be deleted. Please, try again.
af_za: Die FINANSIES AFDELING 80 KOMITEE-dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid Human settlement document
af_za: Ongeldige Menslike nedersettingsdokument

source: The Human settlement document has been saved.
af_za: Die menslike nedersettingsdokument is gered.

source: The Human settlement document could not be saved. Please, try again.
af_za: Die menslike nedersettingsdokument kon nie gered word nie. Probeer asseblief weer.

source: The Human settlement document has been deleted.
af_za: Die menslike nedersettingsdokument is verwyder.

source: The Human settlement document could not be deleted. Please, try again.
af_za: Die menslike nedersettingsdokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE document
af_za: Ongeldige GOP, BELEID, MONITORING & EVALUERING AFDELING 80 KOMITEE-dokument

source: The IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE document has been saved.
af_za: Die GOP, BELEID, MONITERING EN EVALUERING AFDELING 80 KOMITEE-dokument is gestoor.

source: The IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE document could not be saved. Please, try again.
af_za: Die GOP, BELEID, MONITERING EN EVALUERING AFDELING 80 KOMITEE-dokument kon nie gered word nie. Probeer asseblief weer.

source: The IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE document has been deleted.
af_za: Die GOP, BELEID, MONITERING EN EVALUERING AFDELING 80 KOMITEE-dokument is verwyder.

source: The IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE document could not be deleted. Please, try again.
af_za: Die GOP, BELEID, MONITERING EN EVALUERING AFDELING 80 KOMITEE-dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE document
af_za: Ongeldige INFRASTRUKTUUR & TEGNIESE DIENSTE AFDELING 80 KOMITEE-dokument

source: The INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE document has been saved.
af_za: Die INFRASTRUKTUUR EN TEGNIESE DIENSTE AFDELING 80 KOMITEE-dokument is gestoor.

source: The INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE document could not be saved. Please, try again.
af_za: Die INFRASTRUKTUUR EN TEGNIESE DIENSTE AFDELING 80 KOMITEE-dokument kon nie gered word nie. Probeer asseblief weer.

source: The INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE document has been deleted.
af_za: Die INFRASTRUKTUUR EN TEGNIESE DIENSTE AFDELING 80 KOMITEE-dokument is verwyder.

source: The INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE document could not be deleted. Please, try again.
af_za: Die INFRASTRUKTUUR & TEGNIESE DIENSTE AFDELING 80 KOMITEE-dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid Led, Small Business, Spatial Planning and Land Use Management document
af_za: Invalid Led, Small Business, Ruimtelike Beplanning en Grondgebruikbestuur dokument

source: The Led, Small Business, Spatial Planning and Land Use Management document has been saved.
af_za: Die Led, Small Business, Ruimtelike Beplanning en Grondgebruikbestuur dokument is gestoor.

source: The Led, Small Business, Spatial Planning and Land Use Management document could not be saved. Please, try again.
af_za: Die Led, Small Business, Ruimtelike Beplanning en Grondgebruikbestuur dokument kon nie gered word nie. Probeer asseblief weer.

source: The Led, Small Business, Spatial Planning and Land Use Management document has been deleted.
af_za: Die Led, Small Business, Ruimtelike Beplanning en Grondgebruikbestuur dokument is verwyder.

source: The Led, Small Business, Spatial Planning and Land Use Management document could not be deleted. Please, try again.
af_za: Die Led, Small Business, Ruimtelike Beplanning en Grondgebruikbestuur dokument kan nie uitgevee word nie. Probeer asseblief weer.

source: Invalid level
af_za: Ongeldige vlak

source: The level has been saved.
af_za: Die vlak is gestoor.

source: The level could not be saved. Please, try again.
af_za: Die vlak kon nie gestoor word nie. Probeer asseblief weer.

source: The level has been deleted.
af_za: Die vlak is verwyder.

source: The level could not be deleted. Please, try again.
af_za: Die vlak kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid mayco document
af_za: Ongeldige Mayco-dokument

source: The mayco document has been saved.
af_za: Die Mayco-dokument is gestoor.

source: The mayco document could not be saved. Please, try again.
af_za: Die Mayco-dokument kon nie gestoor word nie. Probeer asseblief weer.

source: The mayco document has been deleted.
af_za: Die Mayco-dokument is uitgevee.

source: The mayco document could not be deleted. Please, try again.
af_za: Die Mayco-dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid meeting agenda
af_za: Ongeldige vergadering agenda

source: The meeting agenda has been saved.
af_za: Die vergadering agenda is gestoor.

source: The meeting agenda could not be saved. Please, try again.
af_za: Die vergadering agenda kon nie gestoor word nie. Probeer asseblief weer.

source: The meeting agenda has been deleted.
af_za: Die vergadering agenda is verwyder.

source: The meeting agenda could not be deleted. Please, try again.
af_za: Die vergadering agenda kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid meeting attachment
af_za: Ongeldige vergaderingbylae

source: The meeting attachment has been saved.
af_za: Die vergaderingbylae is gestoor.

source: The meeting attachment could not be saved. Please, try again.
af_za: Die bylae kon nie gestoor word nie. Probeer asseblief weer.

source: The meeting attachment has been deleted.
af_za: Die vergaderingbylae is verwyder.

source: The meeting attachment could not be deleted. Please, try again.
af_za: Die bylae kon nie verwyder word nie. Probeer asseblief weer.

source: Invalid meeting item
af_za: Ongeldige vergaderingitem

source: The meeting item has been saved.
af_za: Die vergadering item is gestoor.

source: The meeting item could not be saved. Please, try again.
af_za: Die vergaderingitem kon nie gestoor word nie. Probeer asseblief weer.

source: The meeting item has been deleted.
af_za: Die vergadering item is verwyder.

source: The meeting item could not be deleted. Please, try again.
af_za: Die vergaderingitem kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid meeting minute
af_za: Ongeldige vergadering minuut

source: Minutes uploaded successfuly.
af_za: Notules suksesvol gelaai.

source: The meeting minute has been saved.
af_za: Die vergadering minuut is gestoor.

source: The meeting minute could not be saved. Please, try again.
af_za: Die vergadering minuut kon nie gestoor word nie. Probeer asseblief weer.

source: The meeting minute has been deleted.
af_za: Die vergadering minuut is verwyder.

source: The meeting minute could not be deleted. Please, try again.
af_za: Die vergadering minuut kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid meeting separatecover
af_za: Ongeldige vergadering afsonderlike dekking

source: The meeting separatecover has been saved.
af_za: Die vergadering se afsonderlike dekking is gestoor.

source: The meeting separatecover could not be saved. Please, try again.
af_za: Die vergadering se afsonderlike dekking kon nie gestoor word nie. Probeer asseblief weer.

source: The meeting separatecover has been deleted.
af_za: Die vergadering se afsonderlike dekking is verwyder.

source: The meeting separatecover could not be deleted. Please, try again.
af_za: Die vergadering se afsonderlike dekking kon nie uitgevee word nie. Probeer asseblief weer.

source: The meeting has been saved.
af_za: Die vergadering is gestoor.

source: The meeting could not be saved. Please, try again.
af_za: Die vergadering is gestoor.

source: The meeting has been deleted.
af_za: Die vergadering is verwyder.

source: The meeting could not be deleted. Please, try again.
af_za: Die vergadering kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid Political Steering document
af_za: Ongeldige Politieke Stuurdokument

source: The Political Steering document has been saved.
af_za: Die Politieke Stuurdokument is gestoor.

source: The Political Steering document could not be saved. Please, try again.
af_za: Die Politieke Stuurdokument kan nie gered word nie. Probeer asseblief weer.

source: The Political Steering document has been deleted.
af_za: Die Politieke Stuurdokument is verwyder.

source: The Political Steering document could not be deleted. Please, try again.
af_za: Die Politieke Stuurdokument kan nie uitgevee word nie. Probeer asseblief weer.

source: Invalid PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE document
af_za: Ongeldige OPENBARE VEILIGHEID EN VERVOER AFDELING 80 KOMITEE-dokument

source: The PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE document has been saved.
af_za: Die OPENBARE VEILIGHEID EN VERVOER AFDELING 80 KOMITEE-dokument is gestoor.

source: The PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE document could not be saved. Please, try again.
af_za: Die OPENBARE VEILIGHEID EN VERVOER AFDELING 80 KOMITEE-dokument kon nie gered word nie. Probeer asseblief weer.

source: The PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE document has been deleted.
af_za: Die OPENBARE VEILIGHEID EN VERVOER AFDELING 80 KOMITEE-dokument is uitgevee.

source: The PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE document could not be deleted. Please, try again.
af_za: Die OPENBARE VEILIGHEID EN VERVOER AFDELING 80 KOMITEE-dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid Revenue Enhancements document
af_za: Ongeldige Inkomsteverbeteringsdokument

source: The Revenue Enhancements document has been saved.
af_za: Die Inkomsteverbeteringsdokument is gestoor.

source: The Revenue Enhancements document could not be saved. Please, try again.
af_za: Die Inkomsteverbeteringsdokument kon nie gestoor word nie. Probeer asseblief weer.

source: The Revenue Enhancements document has been deleted.
af_za: Die Inkomsteverbeteringsdokument is verwyder.

source: The Revenue Enhancements document could not be deleted. Please, try again.
af_za: Die Inkomsteverbeteringsdokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid SPORT, ARTS & CULTURE SECTION 80 COMMITTEE document
af_za: Ongeldige SPORT-, KUNS- EN KULTUURAFDELING 80 KOMITEE-dokument

source: The SPORT, ARTS & CULTURE SECTION 80 COMMITTEE document has been saved.
af_za: Die SPORT-, KUNS- EN KULTUURAFDELING 80-KOMITEE-dokument is gestoor.

source: The SPORT, ARTS & CULTURE SECTION 80 COMMITTEE document could not be saved. Please, try again.
af_za: Die SPORT-, KUNS- EN KULTUURAFDELING 80 KOMITEE-dokument kon nie gered word nie. Probeer asseblief weer.

source: The SPORT, ARTS & CULTURE SECTION 80 COMMITTEE document has been deleted.
af_za: Die SPORT-, KUNS- EN KULTUURAFDELING 80-KOMITEE-dokument is verwyder.

source: The SPORT, ARTS & CULTURE SECTION 80 COMMITTEE document could not be deleted. Please, try again.
af_za: Die SPORT-, KUNS- EN KULTUURAFDELING 80 KOMITEE-dokument kon nie uitgevee word nie. Probeer asseblief weer.

source: Invalid status
af_za: Ongeldige status

source: The status has been saved.
af_za: Die status is gestoor.
