Repository: maffins/Trustcone
Catalog: app/Locale/sut/LC_MESSAGES/default.po
Languages: af_za

source: There are currently no previous minutes documents
af_za: Hajoale ha ho na litokomane tsa metsotso e fetileng

source: ITEMS
af_za: LITABA

source: There are no annexure documents at the moment
af_za: Ha ho na litokomane tsa kenyelletso hona joale

source: SEPARATE COVERS
af_za: LITŠOANTŠO TSA SEBELE

source: There are no separate covers documents at the moment
af_za: Ha ho na sekhetho se koahelang mangolo hona joale

source: ALL MEMBERS OF THE ADHOC COMMITTEE
af_za: BATHO BA BANG BA KOMITE EA ADHOC

source: Add More Members
af_za: Eketsa Litho Tse Eketsehileng

source: Name
af_za: Lebitso

source: Email
af_za: Imeile

source: Cellnumber
af_za: Nomoro ea sele

source: Role
af_za: Karolo

source: View
af_za: Sheba

source: Edit
af_za: Fetola

source: Set permissions
af_za: Beha litumello

source: AUDIT SECTION 79 COMMITTEE
af_za: SEHLOOHO KAROLO 79 KOMITI

source: New Audit Committee
af_za: Komiti e Ncha ea Lipuisano

source: Resend Audit Committee Messages
af_za: Khutlisetsa Melao ea Komiti ea Lipatlisiso

source: All Members of the Audit Committee
af_za: Litho tsohle tsa Komiti ea Lipatlisiso

source: Audit Trails
af_za: Litsela tsa ho hlahloba

source: previous
af_za: se fetileng

source: next
af_za: e 'ngoe

source: Event Description
af_za: Tlhaloso ea Ketsahalo

source: Contents
af_za: Tse ka hare

source: Created
af_za: E bōpiloe

source: CHAIR OF CHAIRS SECTION 79 COMMITTEE
af_za: MORAETSA EA LIPAKI KAROLO 79 KOMITI

source: New Chair of chairs Committee
af_za: Sehlooho se secha sa litulo Komiti

source: CHAIR OF CHAIRS SECTION 79 COMMITTEE RESEND MESSAGES
af_za: MOHLALA OA LIPAKI KAROLO 79 KOMITI E AMA MESSAGES

source: ALL MEMBERS OF CHAIR OF CHAIRS SECTION 79 COMMITTEE
af_za: MESEBETSI E MONG EA CHA CHA MORAHA KAROLO 79 KOMITI

source: User
af_za: Sebedisa

source: Date Sent
af_za: Letsatsi le rometsoeng

source: COMMUNITY SERVICES SECTION 80 COMMITTEE DOCUMENTS
af_za: LITŠEBELETSO TSA SEBELE KAROLO EA 80 LITABA TSA KOMITI

source: Edit Section 79 Document
af_za: Fetola Tokomane ea 79

source: Community services section 80 Committee Documents
af_za: Litšebeletso tsa Sechaba karolo ea 80 Komiti ea Litokomane

source: New Community Services Section 80
af_za: Mesebetsi e mecha ea Sechaba Karolo ea 80

source: Resend Community services section 80 committee Documents Messages
af_za: Ho tsosolosa karolo ea litšebeletso tsa sechaba sa komiti ea 80 Lipampiri Melaetsa

source: ALL MEMBERS OF THE COMMUNITY SERVICES SECTION 80 COMMITTEE DOCUMENTS
af_za: BATHO BA BANG BA TŠEBELETSO EA MANGOA KAROLO EA 80 LITABA TSA KOMITI

source: COMMUNITY SERVICES SECTION 80 COMMITEE MEETING
af_za: LITŠEBELETSO TSA SEBELE KAROLO EA 80 KOPANO EA KOMITI

source: CORPORATE SERVICES SECTION 80 COMMITTEE
af_za: KOMITI EA LIKHUTLO TSA KARETE EA 80

source: CORPORATE SERVICES SECTION 80 COMMITEE
af_za: KOMITI EA LIKHUTLO TSA KARETE EA 80

source: New Corporate Services Section 80
af_za: Litšebeletso tse Ncha tsa Mekhatlo Karolo 80

source: Resend CORPORATE SERVICES SECTION 80 COMMITTEE Messages
af_za: Khutlisetsa KOMITI EA TŠEBELETSO KAROLO EA 80 KOMITI

source: ALL MEMBERS OF THE CORPORATE SERVICES SECTION 80 COMMITTEE
af_za: BATHO BA BANG BA LIKETE TSE KOPITSO EA KHUTO EA 80

source: CAPTURE COUNCIL MEETING DOCUMENTS
af_za: LITABA TSA MESEBETSI EA MOKHATLO

source: Urgent Documents
af_za: Litokomane tse Potlakileng

source: Reports
af_za: Litlaleho

source: Settings
af_za: Lisebelisoa

source: Official Documents
af_za: Litokomane tsa Molao

source: Capture Document
af_za: Ngola Document

source: Users
af_za: Basebedisi

source: View Documents by directorates
af_za: Sheba Litokomane ka lihlopha

source: Council Documents
af_za: Litokomane tsa Lekhotla

source: MAYCO Documents
af_za: Lingoliloeng tsa MAYCO

source: Capture Documents
af_za: Tšoara Litokomane

source: Fault list
af_za: Lenane la bofokoli

source: Capture Meeting Minutes
af_za: Tšoara Metsotso ea Seboka

source: Upload minutes
af_za: Kenya metsotso

source: Edit Council Meeting Documents
af_za: Hlahisa Litokomane tsa Seboka sa Lekhotla

source: Council Meetings List
af_za: Liboka tsa Liboka

source: New Council Documents
af_za: Libuka tse Ncha tsa Lekhotla

source: RESEND COUNCIL MEETING MANAGEMENT MESSAGES
af_za: HLOMELA MESSAGES EA MOKHOA OA HO TSAMAISA BOPHELO

source: ALL MEMBERS OF THE COUNCIL MEETING DOCUMENTS
af_za: BATHO BA BANG BA LITABA TSA MESEBETSI EA MANGANO

source: List Departments
af_za: Lethathamo la Litaba

source: List Documents
af_za: Thathamisa Litokomane

source: New Document
af_za: Tokomane e ncha

source: Departments
af_za: Mesebetsi

source: New Department
af_za: Lefapha le lecha

source: Department
af_za: Lefapha

source: Modified
af_za: E fetotsoe

source: Edit Department
af_za: Fetola Lefapha

source: Related Documents
af_za: Litokomane tse Amanang

source: User Id
af_za: Theneketso

source: Department Id
af_za: Lefapha la Lefapha

source: Telephone
af_za: Thelefono

source: Physical Address
af_za: Sebaka sa Boipheliso

source: Postal Address
af_za: Kerese ea poso

source: Documents list
af_za: Lethathamo la libuka

source: DERMACATION SECTION 79 COMMITTEE
af_za: HO HLAHALA KAROLO 79 KOMITI

source: New Dermacation Committee
af_za: Komiti e Ncha ea ho Khetholla

source: RESEND DERMACATION SECTION 79 COMMITTEE MESSAGES
af_za: ETSA HO HLAHALA KAROLO 79 MESEBETSI EA MEKETE

source: ALL MEMBERS OF THE DERMACATION SECTION 79 COMMITTEE
af_za: BATHO BA BANG BA KHETHO KAROLO EA 79 KOMITI

source: DISPUTE RESOLUTION SECTION 79 COMMITTEE
af_za: KAMOO MOLAO OA BOHLOKOA KAROLO 79 KOMITI

source: New Dispute Resolution Committee
af_za: Komiti ea Khahlano ea Khahlano

source: RESEND DISPUTE RESOLUTION SECTION 79 COMMITTEE MESSAGES
af_za: ETSA TLOTSO EA KHUTO KAROLO 79 MESEBETSI EA MEKETE

source: ALL MEMBERS OF THE DISPUTE RESOLUTION SECTION 79 COMMITTEE
af_za: BATHO BA BANG BA DISPUTE KAROLO EA 79 KOMITI

source: Add Document for signing
af_za: Kenya Tokomane ea ho saena

source: Send Document
af_za: Romela Tokomane

source: Documents
af_za: Litokomane

source: Document
af_za: Tokomane

source: Edit Document
af_za: Fetola Tokomane

source: Delete Document
af_za: Tlosa Tokomane

source: Capture new Document
af_za: Nka Tokomane e ncha

source: Take Action
af_za: Neem aksie

source: Document owned by
af_za: Tokomane e nang le

source: Document type <br />(<small>Click on the name to view the attached document</small>)
af_za: Mofuta oa mongolo <br /> (<small> Tlanya ka lebitso ho sheba tokomane e tiileng </ small>)

source: Date Compiled
af_za: Letsatsi le kopantsoe

source: Document Id
af_za: Idemoro ea Litokomane

source: Resend Mayco Messages
af_za: Khutlisetsa Mayco Melaetsa

source: Filter >>
af_za: Senya >>

source: Compiled by
af_za: E kopantsoe ke

source: Document type (Click to download)
af_za: Mofuta oa maqephe (Click to download)

source: ALL MEMBERS OF THE OFFICIAL DOCUMENTS
af_za: BATHO BA BATHO BA LITABA TSE BOPHELO

source: List Statuses
af_za: Lethathamo la Lintlha

source: New Status
af_za: Boemo bo bocha

source: Documents Trackers
af_za: Dokumente Trackers

source: Status
af_za: Boemo

source: Updated By
af_za: E tsoetseng pele

source: Brought By
af_za: E tlisoa ke

source: Date Brought
af_za: Letsatsi le hlahisitsoe

source: Date Updated
af_za: Letsatsi le tsositsoe

source: SECTION 80 MEETING DOCUMENTS
af_za: KAROLO EA 80 LITABA TSA MESEBETSI

source: Joint Section 80 Committee: LED, Tourism & Human Settlement Commitee Documents
af_za: Komiti e kopaneng ea karolo ea 80: Litaba tsa komiti ea LED, ea Bohahlauli le ea Bolulo

source: LED, Tourism & Human Settlement Commitee
af_za: Komiti ea LED, Tourism & Human Settlement

source: RESEND SECTION 80 MEETING DOCUMENTS MESSAGES
af_za: ETSA LITLHA TSA MOTHEO EA MOKHATLO EA 80

source: ALL MEMBERS OF THE SECTION 80 MEETING DOCUMENTS
af_za: LIPOTSO TSA BATHO BA TŠEBELETSO EA KAROLO EA 80

source: Joint Section 80 Committee: LED, Tourism & Human Settlement Committee
af_za: Komiti e kopaneng ea karolo ea 80: Komiti ea LED, ea Bohahlauli le ea Bolulo

source: OFFICIAL DOCUMENTS
af_za: LITABA TSA MOKHOA

source: COUNCIL DOCUMENTS
af_za: LITABA TSA BOPHELO

source: MAYCO DOCUMENTS
af_za: MAYCO LITABA TSA MAYCO

source: EXCO DOCUMENTS
af_za: EXCO DOKUMENTE

source: Finance Committee
af_za: Komiti ea lichelete

source: Infrastructure & Technical Services Committee
af_za: Komiti ea Litšebeletso le Tšebeletso ea Tšebeletso

source: Community Services Section 80 Committee
af_za: Komiti ea Sechaba Komiti ea 80

source: Public Safety Committee
af_za: Komiti ea Tšireletso ea Sechaba

source: Joint Section 80 Committee: LED, Tourism & Human Settlement
af_za: Komiti e kopaneng ea karolo ea 80: LED, Tourism & Human Settlement

source: Sports, Arts & Culture Committee
af_za: Komiti ea lipapali, tsa bochaba le tsa bochaba

source: Corporate Services Section 80 Committee
af_za: Tšebeletso ea Mekhatlo Komiti ea 80

source: IDP, Policy, Monitoring & Evaluation Committee
af_za: IDP, Leano, Lekala la Tlhahlobo le Ts'ebetso

source: LED, SMALL BUSINESS, SPATIAL PLANNING AND LAND USE MANAGEMENT
af_za: LED, SMALL BUSINESS, HO HLOKAHALA KA TŠEBELETSO LE TŠEBELETSO EA MOSEBETSI

source: HUMAN SETTLEMENT COMMITEE
af_za: KOMITI EA BOPHELO

source: TOURISM, ENVIRONMENT AFFAIRS AND AGRICULTURE COMMITEE
af_za: LITABA, TŠEBELETSO EA TŠEBELETSO LE KOMITI EA LITŠOANTŠISO

source: MPAC Committee
af_za: Komiti ea MPAC

source: Dispute Resolution Committee
af_za: Komiti ea Tharollo ea Likhang

source: Rules Committee
af_za: Komiti ea Melao

source: Chair of Chairs
af_za: Mookameli oa Litulo

source: Political Steering Committee
af_za: Komiti ea Tsamaiso ea Lipolotiki

source: Dermacation Committee
af_za: Komiti ea Tlhaloso

source: Revenue Enhancement
af_za: Ntlafatso ea Lekhetho

source: Audit Committee
af_za: Komiti ea Lipatlisiso

source: LLF MEETING DOCUMENTS
af_za: LITABA TSA LIPHELO TSA LLF

source: MINUTES
af_za: MINUTE

source: USERS
af_za: BASEBETSI

source: SECTION 80 COMMITTEES MEETING DOCUMENTS
af_za: KAROLO 80 LITABA TSA MESEBETSI TSA MESEBETSI

source: Led, Small Business, Spatial Planning and Land Use Management
af_za: Lote, Lits'ebetsong tse nyenyane, Moralo oa libaka le Tsamaiso ea Ts'ebetso ea Mobu

source: Human Settlement Committee
af_za: Komiti ea Bolulo

source: Tourism, Environment Affairs and Agriculture Committee
af_za: Bohahlauli, Boemo ba Tikoloho le Komiti ea Temo

source: SECTION 79 COMMITTEES MEETING DOCUMENTS
af_za: KAROLO 79 LITABA TSA MESEBETSI TSA MEMOA

source: Chair of Chairs Committee
af_za: Mookameli oa Litulo Komiti

source: Revenue Enhancement Committee
af_za: Komiti ea Ntlafatso ea Lekhetho

source: TEMPORARY COMMITTEES
af_za: LIKOMITI TSA KHAOLO

source: ADHOC Committee
af_za: Komiti ea ADHOC

source: Matjhabeng Local Municipality Document Management System
af_za: Matjhabeng Plaaslike Munisipaliteit Dokument Bestuurstelsel

source: Community Services Committee
af_za: Komiti ea Ts'ebeletso ea Sechaba

source: Corporate Services Committee
af_za: Komiti ea Litšebeletso tsa Mekhatlo

source: Its been approved and its with the CFO secretary at the moment
af_za: E amohetse mme e na le mongoli oa CFO hona joale

source: The following document is being requested
af_za: Tokomane e latelang e ntse e etsoa

source: Meeting name:
af_za: Lebitso la kopano:

source: Could not download document with name
af_za: Ha e khone ho boloka tokomane ka lebitso

source: You can email the document to this email
af_za: U ka romella lengolo lengolo ho imeile ena

source: Greetings to you
af_za: Lumeliso ho uena

source: Meeting minutes are posted. Please login to
af_za: Metsotso ea liboka e ngotsoe. Ka kopo oena ho

source: to view the minutes document
af_za: ho sheba lenane la metsotso

source: Username
af_za: Lebitso la hau

source: Password
af_za: Netewete

source: Password reset successfully
af_za: Netefete e tsosolosoa ka katleho

source: Counsilor could not download document
af_za: Moeletsi o ne a sa khone ho kopitsa tokomane

source: Password rest successfull
af_za: Netefete e tsosolosoa ka katleho

source: EXCO MEETING DOCUMENTS
af_za: LITABA TSA MEHLOKO EA EXCO

source: Edit Exco Document
af_za: Fetola Document Exco

source: Exco Documents
af_za: Litokomane tsa Exco

source: New EXCO Meeting
af_za: Seboka se secha sa EXCO

source: RESEND EXCO MEETING DOCUMENTS MESSAGES
af_za: ETSA MESEBETSI EA MEHLOKO EA EXCO MEETING MESSAGES

source: ALL MEMBERS OF THE EXCO MEETING DOCUMENTS
af_za: BATHO BA BANG BA LITABA TSA MEHLOKO EA EXCO

source: Exco Meetings List
af_za: Lethathamo la Liboka tsa Exco

source: Add Comment
af_za: Kenya maikutlo

source: Assinged
af_za: E abeloa

source: Town / Township / Ward number / Location
af_za: Nomoro / Township / Ward nomoro / Sebaka

source: Street Name
af_za: Lebitso la seterateng

source: Date added
af_za: Letsatsi le kenyelelitsoe

source: Comments
af_za: Maikutlo

source: My Comments
af_za: Maikutlo a ka

source: Are you sure the fault is now completed # %s?
af_za: Na u netefatsa hore phoso e se e phethiloe ka%% s?

source: Add comment
af_za: Lewer kommentaar

source: <span class="glyphicon glyphicon-edit"></span>&nbsp&nbsp;Edit Faults Comment
af_za: <span class = “glyphicon glyphicon-edit”> </ span> & nbsp & nbsp; wysig foute Kommentaar

source: <span class="glyphicon glyphicon-remove"></span>&nbsp;&nbsp;Delete Faults Comment
af_za: <span class = “glyphicon glyphicon-remove”> </ span> & nbsp; & nbsp; Verwyder foute Kommentaar

source: <span class="glyphicon glyphicon-list"></span>&nbsp&nbsp;List Users
af_za: <span class = “glyphicon glyphicon-list”> </ span> & nbsp & nbsp; Sebelisa Basebelisi

source: <span class="glyphicon glyphicon-plus"></span>&nbsp&nbsp;New User
af_za: <span class = “glyphicon glyphicon-plus”> </ span> & nbsp & nbsp; Mocha o Mocha

source: Comment
af_za: Maikutlo

source: Date Responded
af_za: Letsatsi le arabe

source: Document Name
af_za: Lebitso la Ditokomane

source: Assigned To
af_za: E abeloa ho

source: Date Actioned
af_za: Letsatsi le nkiloe

source: Date Completed
af_za: Letsatsi le phethiloe

source: Action Taken
af_za: Khato e Nkiloeng

source: FINANCE SECTION 80 COMMITTEE
af_za: KOMITI EA FINANCE KAROLO EA 80

source: New Finance Committee
af_za: Komiti e Ncha ea Lichelete

source: RESEND FINANCE SECTION 80 COMMITTEE MESSAGES
af_za: ETSA FINANCE KAROLO EA 80 MESEBETSI EA KOMITI

source: ALL MEMBERS OF THE FINANCE SECTION 80 COMMITTEE
af_za: BATHO BA BANG BA FINITI KARETE EA 80

source: HUMAN SETTLEMENT COMMITEE SECTION 80 COMMITTEE
af_za: KOMITI EA HUMAN SETTLEMENT COMMITTEE KAROLO EA 80 KOMITI

source: IHUMAN SETTLEMENT SECTION 80 COMMITTEE
af_za: KOMITI EA BOPHELO BA KAROLO EA 80

source: RESEND HUMAN SETTLEMENT COMMITEE SECTION 80 COMMITTEE MESSAGES
af_za: HLOMELA KOMITTE EA HUMAN SETTLEMENT KAROLO EA 80 METEBETSI EA LIKETITI

source: ALL MEMBERS OF THE HUMAN SETTLEMENT COMMITEE SECTION 80 COMMITTEE
af_za: HLOMELA KOMITTE EA HUMAN SETTLEMENT KAROLO EA 80 METEBETSI EA LIKETITI

source: IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE
af_za: IDP, POLICY, TŠEBELISO LE HO HLOKAHALA KAROLO EA 80 KOMITI

source: New IDP Polic Services
af_za: Lits'ebeletso tse ncha tsa Leano la IDP

source: RESEND IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE MESSAGES
af_za: HLOMELA IDP, POLICY, HO ETSA LE HO HLOKAHALA KAROLO EA 80 MESEBETSI EA KOMITI

source: ALL MEMBERS OF THE IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE
af_za: BATHO BA BANG BA IDP, POLICY, TEKETSO LE TŠEBELISO KAROLO EA 80 KOMITI

source: INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE
af_za: LITABA TSA LINTHO TSE KOPITSOANG LE TŠEBELETSO KARETE EA 80 KOMITI

source: New Infrastructure Services
af_za: Litšebeletso tse Ncha tsa Ts'ebeliso ea Sechaba

source: RESEND INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE MESSAGES
af_za: HLOKA LITLHAHISO TSA LITŠOANTŠISO LE TSEBELETSO KAROLO EA 80 MESEBETSI EA KOMITI

source: ALL MEMBERS OF THE INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE
af_za: BATHO BA BANG BA TŠEBELETSO LE TŠEBELETSO EA TŠEBELETSO KARETE EA 80 KOMITI

source: LED, SMALL BUSINESS, SPATIAL PLANNING AND LAND USE MANAGEMENT SECTION 80 COMMITTEE
af_za: LED, SMALL BUSINESS, HO HLAHLISOA TSA MOLEMO LE TŠEBELISO EA MOSEBETSI KAROLO EA 80 KOMITI

source: New LED
af_za: LED e ncha

source: RESEND LED, SMALL BUSINESS, SPATIAL PLANNING AND LAND USE MANAGEMENT SECTION 80 COMMITTEE MESSAGES
af_za: BALA LED, BUSINESS SMALL, LIPHATLO TSA SEBELE LE TŠEBELETSO EA MOSEBETSI KAROLO EA 80 MESEBETSI EA KOMITI

source: ALL MEMBERS OF THE LED, SMALL BUSINESS, SPATIAL PLANNING AND LAND USE MANAGEMENT SECTION 80 COMMITTEE
af_za: BATHO BA BANG BA LED, BUSINESS SMALL, LIPHATLO TSA SEBELE LE TŠEBELETSO EA MOSEBETSI KAROLO EA 80 KOMITI

source: MAYCO MEETING DOCUMENTS
af_za: MOKHATLO OA MANGOLO OA MESEBETSI

source: Edit Mayco Document
af_za: Fetola Tokomane ea Mayco

source: New MAYCO Meeting
af_za: Seboka se secha sa MAYCO

source: ALL MEMBERS OF THE MAYCO MEETING DOCUMENTS
af_za: BATHO BA BANG BA MOKHATLO OA MANGCO

source: Mayco Meetings List
af_za: Mayco Liboka tsa Liboka

source: Add Meeting Agenda
af_za: Eketsa Lenaneo la Kopano

source: List Meeting Agendas
af_za: Thathamisa Litsela tsa Kopano

source: List Meetings
af_za: Lethathamo la Liboka

source: New Meeting
af_za: Seboka se secha

source: Edit Meeting Agenda
af_za: Wysig vergadering agenda

source: Meeting Agendas
af_za: Likamano tsa Kopano

source: New Meeting Agenda
af_za: Lenaneo le Ncha la Kopano

source: Meetings
af_za: Liboka

source: Meeting
af_za: Seboka

source: Meeting Agenda
af_za: Lenaneo la Kopano

source: Uploaded)by
af_za: E behiloe)

source: Meeting Items
af_za: Edit Meeting Item

source: Add Meeting Minutes for
af_za: Eketsa Metsotso ea Seboka

source: Add Minutes
af_za: Kenya Lipotso

source: Edit Meeting Minute
af_za: Fetola Seboka sa Seboka

source: Meeting Minute
af_za: Mesebetsi ea Seboka

source: Add Meeting
af_za: Eketsa Seboka

source: Edit Meeting
af_za: Fetola Seboka

source: Meeting Minutes
af_za: Metsotso ea Seboka

source: Uploaded By
af_za: E rometsoe ke

source: Related Meeting Agendas
af_za: Amanang le Liboka tsa Kopano

source: Meeting Id
af_za: Id ea Seboka

source: Related Meeting Attachments
af_za: Verwante vergadering aanhangsels

source: MPAC SECTION 79 COMMITTEE
af_za: MPAC KAROLO 79 KOMITI

source: New Mpac Committee
af_za: Komiti e ncha ea Mpac

source: RESEND MPAC SECTION 79 COMMITTEE MESSAGES
af_za: TSOELA MPAC KAROLO 79 MESEBETSI EA MEKETE

source: ALL MEMBERS OF THE MPAC SECTION 79 COMMITTEE
af_za: BATHO BA BANG BA MPAC KAROLO EA 79 KOMITI

source: User Types
af_za: Mefuta ea basebetsi

source: POLITICAL STEERING SECTION 79 COMMITTEE
af_za: TŠEBELETSO EA MOLAO KAROLO 79 KOMITI

source: New Political Committee
af_za: Komiti e Ncha ea Lipolotiki

source: RESEND POLITICAL STEERING SECTION 79 COMMITTEE MESSAGES
af_za: TŠEBELISO EA LIPOTSO TSA SEBELETSO SEQEPHE 79 MESEBETSI EA KOMITI

source: ALL MEMBERS OF THE POLITICAL STEERING SECTION 79 COMMITTEE
af_za: BATHO BA BATHO BA POLITIKI BA KHETHA KAROLO EA 79 KOMITI

source: PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE
af_za: BOKHOA LE TŠEBELISO TSA KOMITE EA 80

source: New Public safity Committee
af_za: Komiti e ncha ea polokeho ea sechaba

source: RESEND PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE MESSAGES
af_za: TSOELA LITŠOANTŠISO LE TŠEBELETSO EA SEBELE KAROLO EA 80 MESEBETSI EA KOMITI

source: ALL MEMBERS OF THE PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE
af_za: BATHO BA BANG BA BOPHELO LE TŠEBELISO TSA COMMITTE EA 80

source: REVENUE ENHANCEMENT SECTION 79 COMMITTEE
af_za: TŠEBELETSO EA KOPITSOENG KAROLO 79 KOMITI

source: New Revenue Committee
af_za: Komiti e Ncha ea Lekhetho

source: RESEND REVENUE ENHANCEMENT SECTION 79 COMMITTEE MESSAGES
af_za: ETSA TŠEBELETSO EA SEBELETSO KAROLO 79 MESEBETSI EA KOMITI

source: ALL MEMBERS OF THE REVENUE ENHANCEMENT SECTION 79 COMMITTEE
af_za: BATHO BA BANG BA KHETHO EA SEBELETSO KAROLO 79 KOMITI

source: RULES SECTION 79 COMMITTEE
af_za: E LAOLA KAROLO 79 KOMITI

source: New Rules Committee
af_za: Komiti e Ncha ea Melao

source: RESEND RULES SECTION 79 COMMITTEE MESSAGES
af_za: ETSA MOLAO KAROLO 79 MESEBETSI EA MEKETE

source: ALL MEMBERS OF THE RULES SECTION 79 COMMITTEE
af_za: BATHO BA BANG BA MOLAO KAROLO EA 79 KOMITI

source: Mayco Meeting Documents
af_za: Mayco Litokomane tsa Seboka

source: Capture Official Document
af_za: Tšoara Tokomane e Ngotsoeng

source: New Council Meeting
af_za: Seboka se secha sa Lekhotla

source: SPORT, ARTS & CULTURE SECTION 80 COMMITTEE
af_za: SPORT, ARTS & CULTURE KAROLO EA 80 KOMITI

source: New Sports,Art,Culture Services
af_za: Lipapali tse Ncha, Litšoantšo, Litšebeletso tsa Sechaba

source: RESEND SPORT, ARTS & CULTURE SECTION 80 COMMITTEE MESSAGES
af_za: HLOKA LITŠOANTŠISO, LITABA LE TŠEBELETSO KAROLO 80 MESEBETSI EA MEKETHE

source: ALL MEMBERS OF THE SPORT, ARTS & CULTURE SECTION 80 COMMITTEE
af_za: BATHO BA BANG BA SPORT, ARTS & CULTURE KAROLO EA 80 KOMITI

source: TOURISM, ENVIRONMENT AFFAIRS AND AGRICULTURE SECTION 80 COMMITTEE
af_za: TOERISME, OMGEWINGSAKE EN LANDBOUW AFDELING 80 KOMITEE

source: New Tourism
af_za: Bohahlauli bo Bocha

source: RESEND TOURISM, ENVIRONMENT AFFAIRS AND AGRICULTURE SECTION 80 COMMITTEE MESSAGES
af_za: ETSA TŠEBELETSO, MESEBETSI EA TŠEBELETSO LE TEKETSO KAROLO 80 MESEBETSI EA KOMITI

source: ALL MEMBERS OF THE TOURISM, ENVIRONMENT AFFAIRS AND AGRICULTURE SECTION 80 COMMITTEE
af_za: BATHO BA BANG BA TOURISM, METSEBETSI EA TŠEBELETSO LE TEKETSO KAROLO EA 80 KOMITI

source: Add User
af_za: Kenya Motlatsi

source: Create User
af_za: Etsa Mosebetsi

source: Edit User
af_za: Fetola User

source: Delete User
af_za: Tlosa Mosebeletsi

source: AUDIT TRAIL
af_za: KHETHO EA TRAIT

source: Save Changes
af_za: Boloka Liphetoho

source: Have you forgotten your password
af_za: Na u lebetse phasewete ea hau

source: Click here
af_za: Tlanya mona

source: My profile
af_za: Boemo ba ka

source: First Name
af_za: Lebitso la pele

source: Surname
af_za: Lebitso

source: Please enter the new password (at least 8 characters and use a combination of uppercase and lower case letters)
af_za: Ka kopo kenya phasewete e ncha (bonyane litlhaku tse 8 'me u sebelise motsoako oa mangolo a maholo le a tlaase)

source: Set Permision for
af_za: Beha tumello bakeng sa

source: Permission name
af_za: Lebitso la tumello

source: Scriber
af_za: Moqapi

source: Capture Minutes
af_za: Tšoara metsotso

source: Set Permissions
af_za: Beha Litumello

source: Please enter the code that has been sent to your number
af_za: Ka kopo kenya khoutu e rometsoeng palo ea hau

source: Please click on the button above to choose what you want to do
af_za: Ka kopo, tobetsa konopo e ka holimo ho khetha seo u batlang ho se etsa

source: Welcome you are logged in as
af_za: Rea u amohela u kena le hau

source: Last Name
af_za: Fane

source: Choose your language
af_za: Khetha puo ea hau
