Repository: maffins/Trustcone
Catalog: app/Locale/sut/LC_MESSAGES/default.po
Languages: af_za

source: Invalid meeting
af_za: Kopano e fosahetseng

source: Uploaded successfuly.
af_za: Di tsamaisitswe ka katleho.

source: Invalid mpac document
af_za: Tokomane e fosahetseng ya Komiti ya MPAC

source: The mpac document has been saved.
af_za: Tokomane ya Komiti ya MPAC e bolokilwe.

source: The mpac document could not be saved. Please, try again.
af_za: Tokomane ya Komiti ya MPAC e hlolehile ho bolokeha. Ka kopo leka hape.

source: The mpac document has been deleted.
af_za: Tokomane ya Komiti ya MPAC e tlositswe.

source: The mpac document could not be deleted. Please, try again.
af_za: Tokomane ya Komiti ya MPAC e hlolehile ho hlakoha. Ka kopo leka hape..

source: Added documents to meeting successfuly.
af_za: Ditokomane di ekeditswe kopanong ka katleho.

source: Your messages have been sent.
af_za: Melaetsa ya hao e rometswe.

source: Invalid Audit Committee document
af_za: Tokomane e fosahetseng ya Komiti ya Tlhatlhobo

source: The Audit Committee document has been saved.
af_za: Tokomane ya Komiti ya Tlhatlhobo e bolokilwe.

source: The Audit Committee document could not be saved. Please, try again.
af_za: Tokomane ya Komiti ya Tlhatlhobo e hlolehile ho bolokeha. Ka kopo leka hape.

source: The Audit Committee document has been deleted.
af_za: Tokomane ya Komiti ya Tlhatlhobo e hlakotswe.

source: The Audit Committee document could not be deleted. Please, try again.
af_za: Tokomane ya Komiti ya Tlhatlhobo e hlolehile ho hlakoleha. Ka kopo leka hape.

source: Invalid audit trail
af_za: Tsela ya Tlhahlobo e fosahetseng

source: The audit trail has been saved.
af_za: Tsela ya tlhahlobo e bolokilwe.

source: The audit trail could not be saved. Please, try again.
af_za: Tsela ya tlhahlobo e hlolehile ho bolokeha. Ka kopo leka hape.

source: The audit trail has been deleted.
af_za: Tsela ya tlhahlobo e hlakotswe. Ka kopo leka hape.

source: The audit trail could not be deleted. Please, try again.
af_za: Tsela ya tlhahlobo e hlolehile ho hlakoleha. Ka kopo leka hape.

source: Invalid CHAIR OF CHAIRS document
af_za: Tokomane e fosahetseng ya Komiti ya Modulasetulo wa Badulasetulo

source: The CHAIR OF CHAIRS document has been saved.
af_za: Tokomane ya Komiti ya Modulasetulo wa Badulasetulo e bolokilwe.

source: The CHAIR OF CHAIRS document has been deleted.
af_za: Tokomane ya Komiti ya Modulasetulo wa Badulasetulo e tlositswe.

source: The CHAIR OF CHAIRS document could not be deleted. Please, try again.
af_za: Tokomane ya Komiti ya Modulasetulo wa Badulasetulo ha e hlolehile ho hlakoleha. Ka kopo leka hape.

source: Invalid communication log
af_za: Leano la Puisano le fosahetseng

source: The communication log has been saved.
af_za: Leano la Puisano le bolokilwe.

source: The communication log could not be saved. Please, try again.
af_za: Leano la Puisano le hlolehile ho bolokeha. Ka kopo leka hape.

source: The communication log has been deleted.
af_za: Leano la Puisano e tlositswe.

source: The communication log could not be deleted. Please, try again.
af_za: Leano la Puisano ha le hlolehile ho hlakoleha. Ka kopo leka hape.

source: Invalid Community Service Section 80 document
af_za: Tokomane e fosahetseng ya Komiti ya Karolo ya 80 ya Ditshebeletso tsa Setjhaba

source: The Community Service Section 80 document has been saved.
af_za: Tokomane ya Komiti ya Karolo ya 80 ya Ditshebeletso tsa Setjhaba e bolokilwe.

source: The Community Service Section 80 document could not be saved. Please, try again.
af_za: Tokomane ya Komiti ya Karolo ya 80 ya Ditshebeletso tsa Setjhaba e hlolehile ho bolokeha. Ka kopo leka hape.

source: The Community Service Section 80 document has been deleted.
af_za: Tokomane ya Komiti ya Karolo ya 80 ya Ditshebeletso tsa Setjhaba e hlakotswe.

source: The Community Service Section 80 document could not be deleted. Please, try again.
af_za: Tokomane ya Komiti ya Karolo ya 80 ya Ditshebeletso tsa Setjhaba e hlolehile ho hlakoleha. Ka kopo leka hape.

source: Added document to meeting successfuly.
af_za: Bygevoeg dokument om suksesvol te ontmoet.

source: Invalid CORPORATE SERVICES COMMITTEE document
af_za: Tokomane e fosahetseng ya Komiti ya Karolo ya 80 ya Tshehetso ya Ditshebeletso tsa Kgwebo

source: The CORPORATE SERVICES COMMITTEE document has been saved.
af_za: Tokomane ya Komiti ya Karolo ya 80 ya Tshehetso ya Ditshebeletso tsa Kgwebo e bolokilwe.

source: The CORPORATE SERVICES COMMITTEE document has been deleted.
af_za: Tokomane ya Komiti ya Karolo ya 80 ya Tshehetso ya Ditshebeletso tsa Kgwebo e hlakotswe.

source: The CORPORATE SERVICES COMMITTEE document could not be deleted. Please, try again.
af_za: Tokomane ya Komiti ya Karolo ya 80 ya Tshehetso ya Ditshebeletso tsa Kgwebo e hlolehile ho hlakoleha. Ka kopo leka hape.

source: Invalid counsilor document
af_za: Tokomane e fosahetseng ya Kopano ya Lekgotla

source: The counsilor document has been deleted.
af_za: Tokomane ya Kopano ya Lekgotla e bolokilwe.

source: The counsilor document could not be deleted. Please, try again.
af_za: Tokomane ya Kopano ya Lekgotla e hlolehile ho bolokeha. Ka kopo leka hape.

source: Documents added to meeting successfuly.
af_za: Ditokomane di ekeditswe kopanong ka katleho.

source: The current meeting have been added successfuly.
af_za: Die huidige vergadering is suksesvol bygevoeg.

source: Invalid cousilor report
af_za: Tlaleho e fosahetseng ya Kopano ya Lekgotla

source: The report has been saved and sent.
af_za: Tlaleho e bolokilwe le ho romelwa.

source: The cousilor report could not be saved. Please, try again.
af_za: Tokomane ya Kopano ya Lekgotla e hlolehile ho bolokeha. Ka kopo leka.

source: The cousilor report has been saved.
af_za: Tokomane ya Kopano ya Lekgotla e bolokilwe.

source: The cousilor report has been deleted.
af_za: Tlaleho ya Kopano ya Lekgotla e hlakotswe.

source: The cousilor report could not be deleted. Please, try again.
af_za: Tokomane ya Kopano ya Lekgotla e hlolehile ho hlakoleha. Ka kopo leka.

source: Invalid department
af_za: Lefapha le fosahetseng

source: The department has been saved.
af_za: Lefapha le bolokilwe.

source: The department could not be saved. Please, try again.
af_za: Lefapha le hlolehile ho bolokeha. Ka kopo leka hape.

source: The department has been deleted.
af_za: Lefapha le hlakotswe.

source: The department could not be deleted. Please, try again.
af_za: Lefapha le hlolehile ho hlakoleha. Ka kopo leka hape.

source: Invalid Dermacation Committee document
af_za: Tokomane e fosahetseng ya Komiti ya Meedi

source: The Dermacation Committee document has been saved.
af_za: Tokomane ya Komiti ya Meedi e bolokilwe.

source: The Dermacation Committee document could not be saved. Please, try again.
af_za: Tokomane ya Komiti ya Meedi e hlolehile ho bolokeha. Ka kopo leka hape.

source: The Dermacation Committee document has been deleted.
af_za: Tokomane ya Komiti ya Meedi e hlakotswe.

source: The Dermacation Committee document could not be deleted. Please, try again.
af_za: Tokomane ya Komiti ya Meedi e hlolehile ho hlakoleha. Ka kopo leka hape.

source: The document you are requesting for cannot be located
af_za: Tokomane eo o e batlang ha e fumanwe

source: Your decision and reason was successfully saved and notification sent.
af_za: Qeto le lebaka la hao di bolokehile ka katleho le tsebiso e rometswe.

source: Invalid document
af_za: Tokomane e fosahetseng

source: The document creation could not continue as the CFO has not been created yet in the system.
af_za: Pōpo ea tokomane e sitoa ho tsoela pele kaha CFO ha e e-s'o bōptjoe leha ho le joalo tsamaisong ena.

source: The CFO was not found in the system please contact the administrator.
af_za: CFO e sa fumanoa tsamaisong ka kopo ikopanye le molaoli.

source: The document has been saved.
af_za: Tokomane e bolokiloe.

source: The document could not be saved. Please, try again.
af_za: Tokomane e ke ke ea bolokeha. Ka kopo, leka hape.

source: Successfully created a document/s.
af_za: O bōpile ka katleho tokomane / s.

source: Edited successfuly.
af_za: E fetotsoe ka katleho.

source: The document could not be edited. Please, try again.
af_za: Tokomane eo ha ea ka ea hlophisoa. Ka kopo, leka hape.

source: The document has been deleted.
af_za: Tokomane e tlosoa.

source: The document could not be deleted. Please, try again.
af_za: Tokomane e ke ke ea tlosoa. Ka kopo, leka hape.

source: The Eighty document has been saved.
af_za: Tokomane ea Mashome a mane e bolokiloe.

source: The Eighty document has been deleted.
af_za: Die agtste dokument is uitgevee.

source: Invalid exco document
af_za: Tokomane ea exco e sa lokelang

source: The exco document has been saved.
af_za: Tokomane ea exco e bolokiloe.

source: The exco document could not be saved. Please, try again.
af_za: Tokomane ea exco e ke ke ea bolokeha. Ka kopo, leka hape.

source: The exco document has been deleted.
af_za: Tokomane ea exco e tlosoa.

source: The exco document could not be deleted. Please, try again.
af_za: Tokomane ea exco e ke ke ea tlosoa. Ka kopo, leka hape.

source: Added doucments to meeting successfuly.
af_za: Litokomane tse eketsehileng ho kopana ka katleho.

source: Documents Uploaded successfuly.
af_za: Documents e rometsoe ka katleho.

source: Invalid FINANCE SECTION 80 COMMITTEE document
af_za: Ntho e sa lokelanghaleng FINANCE KAROLO EA 80 KAMITI ea tokomane

source: The FINANCE SECTION 80 COMMITTEE document has been saved.
af_za: Tokomane ea FINANCE SECTION 80 ea komiti e bolokiloe.

source: The FINANCE SECTION 80 COMMITTEE document could not be saved. Please, try again.
af_za: Lengolo la Komiti ea FINANCE SECTION 80 le ke ke la bolokeha. Ka kopo, leka hape.

source: The FINANCE SECTION 80 COMMITTEE document has been deleted.
af_za: Tokomane ea FINANCE SECTION 80 ea komiti e tlosoa.

source: The FINANCE SECTION 80 COMMITTEE document could not be deleted. Please, try again.
af_za: Lengolo la Komiti ea FINANCE SECTION 80 le ke ke la tlosoa. Ka kopo, leka hape.

source: Invalid Human settlement document
af_za: Tokomane e sa nepahaleng ea bolulo ba batho

source: The Human settlement document has been saved.
af_za: Tokomane ea bolulo ea Batho e bolokiloe.

source: The Human settlement document could not be saved. Please, try again.
af_za: Tokomane ea bolulo ea Batho e ke ke ea bolokeha. Ka kopo, leka hape.

source: The Human settlement document has been deleted.
af_za: Tokomane ea bolulo ea Batho e tlosoa.

source: The Human settlement document could not be deleted. Please, try again.
af_za: Tokomane ea bolulo ea Botho ha ea ka ea tlosoa. Ka kopo, leka hape.

source: Invalid IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE document
af_za: IDP e sa lokelang, POLICY, HO ETSA LE HO HLOKAHALA KAROLO EA 80 KAMITI

source: The IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE document has been saved.
af_za: IDP, POLICY, HO ETSA LE HO HLOKAHALA KAROLO EA 80 ea komiti e bolokiloe.

source: The IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE document could not be saved. Please, try again.
af_za: IDP, POLICY, HO ETSA LE HO HLOKAHALA KAROLO EA 80 ea komiti e ke ke ea bolokeha. Ka kopo, leka hape.

source: The IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE document has been deleted.
af_za: IDP, POLICY, HO ETSA LE HO HLOKAHALA KAROLO EA 80 ea komiti e tlosoa.

source: The IDP, POLICY, MONITORING & EVALUATION SECTION 80 COMMITTEE document could not be deleted. Please, try again.
af_za: IDP, POLICY, HO ETSA LE HO HLAHLAHALA KAROLO EA 80 ea komiti ea K'hatholike e ke ke ea tlosoa. Ka kopo, leka hape.

source: Invalid INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE document
af_za: Tšebeliso e sa lokelang ea INFRASTRUCTURE & TECHNICAL SERVICES KAROLO EA 80 KAMITI ea tokomane

source: The INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE document has been saved.
af_za: Sebeletso ea INFRASTRUCTURE & TECHNICAL SEHLOOHO EA KOMITI EA 80 e bolokiloe.

source: The INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE document could not be saved. Please, try again.
af_za: Ts'ebetso ea INFRASTRUCTURE & TECHNICAL SECTION 80 ea komiti ha ea ka ea bolokeha. Ka kopo, leka hape.

source: The INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE document has been deleted.
af_za: Ts'ebetso ea INFRASTRUCTURE & TECHNICAL SECTION 80 ea komiti e tlosoa.

source: The INFRASTRUCTURE & TECHNICAL SERVICES SECTION 80 COMMITTEE document could not be deleted. Please, try again.
af_za: Ts'ebetso ea INFRASTRUCTURE & TECHNICAL SECTION 80 ea komiti ea K'hatholike e ke ke ea tlosoa. Ka kopo, leka hape.

source: Invalid Led, Small Business, Spatial Planning and Land Use Management document
af_za: Letsoalo le sa lokelang, Khoebo e Nyenyane, Tokiso ea libaka le Tokiso ea Ts'ebetso ea Tšebeliso ea Mobu

source: The Led, Small Business, Spatial Planning and Land Use Management document has been saved.
af_za: Lefapha la Led, le Monyenyane, Lefapha la Palo ea Libaka le Tsamaiso ea Tsamaiso ea Ts'ebetso ea Lefa e bolokiloe.

source: The Led, Small Business, Spatial Planning and Land Use Management document could not be saved. Please, try again.
af_za: Lefapha la Led, le Monyenyane, Lefapha la Palo ea Libaka le Tsamaiso ea Tsamaiso ea Ts'ebetso ea Mobu ha ea ka ea bolokeha. Ka kopo, leka hape.

source: The Led, Small Business, Spatial Planning and Land Use Management document has been deleted.
af_za: Lefapha la Led, le Monyenyane, Lefapha la Tlhokomelo ea Libaka le Tokiso ea Ts'ebetso ea Ts'ebetsong e sebelisitsoe.

source: The Led, Small Business, Spatial Planning and Land Use Management document could not be deleted. Please, try again.
af_za: Lefapha la Led, le Monyenyane, Lefapha la Palo ea Libaka le Tokiso ea Ts'ebetsong ea Ts'ebetso ea Lefatše le ke ke la tlosoa. Ka kopo, leka hape.

source: Invalid mayco document
af_za: Tokomane ea mayco e sa lokelang

source: The mayco document has been saved.
af_za: Tokomane ea mayco e bolokiloe.

source: The mayco document could not be saved. Please, try again.
af_za: Tokomane ea mayco e ke ke ea bolokeha. Ka kopo, leka hape.

source: The mayco document has been deleted.
af_za: Tokomane ea mayco e tlosoa.

source: The mayco document could not be deleted. Please, try again.
af_za: Tokomane ea mayco e ke ke ea tlosoa. Ka kopo, leka hape.

source: Invalid meeting agenda
af_za: Lenaneo la seboka se sa lokelang

source: The meeting agenda has been saved.
af_za: Lenaneo la seboka le bolokiloe.

source: The meeting agenda could not be saved. Please, try again.
af_za: Seboka sa seboka se ke ke sa bolokeha. Ka kopo, leka hape.

source: The meeting agenda has been deleted.
af_za: Lenaneo la seboka le tlosoa.

source: The meeting agenda could not be deleted. Please, try again.
af_za: Seboka sa seboka se ke ke sa tlosoa. Ka kopo, leka hape.

source: Invalid meeting attachment
af_za: Sebopeho sa seboka se sa lokelang

source: The meeting attachment has been saved.
af_za: Sebopeho sa liboka se bolokiloe.

source: The meeting attachment could not be saved. Please, try again.
af_za: Sebopeho sa seboka ha sea ka sa bolokeha. Ka kopo, leka hape.

source: The meeting attachment has been deleted.
af_za: Sehlopha sa liboka se tlosoa.

source: The meeting attachment could not be deleted. Please, try again.
af_za: Sebopeho sa seboka se ke ke sa tlosoa. Ka kopo, leka hape.

source: Invalid meeting item
af_za: Ntho e sa lokelang ea seboka

source: The meeting item has been saved.
af_za: Ntho ea seboka e bolokiloe.

source: The meeting item could not be saved. Please, try again.
af_za: Ntho ea seboka ha ea ka ea bolokeha. Ka kopo, leka hape.

source: The meeting item has been deleted.
af_za: Ntho ea seboka e tlosoa.

source: The meeting item could not be deleted. Please, try again.
af_za: Sebopeho sa seboka se ke ke sa tlosoa. Ka kopo, leka hape.

source: Invalid meeting minute
af_za: Metsotso ea seboka e sa lokelang

source: Minutes uploaded successfuly.
af_za: Metsotso e behiloe ka katleho.

source: The meeting minute has been saved.
af_za: Metsotso ea seboka e bolokiloe.

source: The meeting minute could not be saved. Please, try again.
af_za: Metsotso ea seboka ha ea ka ea bolokeha. Ka kopo, leka hape.

source: The meeting minute has been deleted.
af_za: Metsotso ea seboka e tlosoa.

source: The meeting minute could not be deleted. Please, try again.
af_za: Metsotso ea seboka ha ea ka ea tlosoa. Ka kopo, leka hape.

source: Invalid meeting separatecover
af_za: Sekoahelo se sa lokelang sa liboka

source: The meeting separatecover has been saved.
af_za: Seboka se arohaneng sekoahelo se bolokiloe.

source: The meeting separatecover could not be saved. Please, try again.
af_za: Seboka se arohaneng sekoahelo se ke ke sa bolokeha. Ka kopo, leka hape.

source: The meeting separatecover has been deleted.
af_za: Seboka se arohaneng sekoahelo se tlosoa.

source: The meeting separatecover could not be deleted. Please, try again.
af_za: Seboka separatecover se ke sa tlosoa. Ka kopo, leka hape.

source: The meeting has been saved.
af_za: Seboka se bolokiloe.

source: The meeting could not be saved. Please, try again.
af_za: Seboka ha sea ka sa bolokeha. Ka kopo, leka hape.

source: The meeting has been deleted.
af_za: Seboka se tlosoa.

source: The meeting could not be deleted. Please, try again.
af_za: Seboka ha sea ka sa tlosoa. Ka kopo, leka hape.

source: Invalid Political Steering document
af_za: Tokomane e sa lokelang ea Lipolotiki

source: The Political Steering document has been saved.
af_za: Lethathamo la Lipolotiki li bolokiloe.

source: The Political Steering document could not be saved. Please, try again.
af_za: Tokomane ea Lipolotiki e ne e sa bolokehe. Ka kopo, leka hape.

source: The Political Steering document has been deleted.
af_za: Lethathamo la Lipolotiki li tlosoa.

source: The Political Steering document could not be deleted. Please, try again.
af_za: Tokomane ea Lipolotiki e ne e sa tlosoe. Ka kopo, leka hape.

source: Invalid PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE document
af_za: Tokisetso e sa nepahaleng ea TŠEBELETSO LE TŠEBELISO KAROLO EA 80 KOMITI EA KOMITI

source: The PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE document has been saved.
af_za: TOKHETSO EA TŠEBELETSO LE TŠEBETHO KAROLO EA 80 ea komiti e bolokiloe.

source: The PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE document could not be saved. Please, try again.
af_za: Ts'ebetso ea Sechaba sa Boikarabello le Ts'ebetso ea Sekhotla sa 80 se ke ke sa bolokeha. Ka kopo, leka hape.

source: The PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE document has been deleted.
af_za: SEBAKA SA TŠEBELETSO LE TŠEBETHO KAROLO EA 80 ea komiti e tlosoa.

source: The PUBLIC SAFETY AND TRANSPORT SECTION 80 COMMITTEE document could not be deleted. Please, try again.
af_za: Ts'ebetso ea Sechaba sa Boitšireletso le Ts'ebetso ea K'homphieutha se ke ke sa tlosoa. Ka kopo, leka hape.

source: Invalid Revenue Enhancements document
af_za: Litokomane tsa Ntšetso-pele tse sa lokelang

source: The Revenue Enhancements document has been saved.
af_za: Tokomane ea Lintlafatso tsa Lekhetho e bolokiloe.

source: The Revenue Enhancements document could not be saved. Please, try again.
af_za: Tokomane ea Lintlafatso tsa Lekhetho ha ea ka ea bolokeha. Ka kopo, leka hape.

source: The Revenue Enhancements document has been deleted.
af_za: Tokomane ea Lintlafatso tsa Lekhetho e tlosoa.

source: The Revenue Enhancements document could not be deleted. Please, try again.
af_za: Tokomane ea Lintlafatso tsa Lekhetho ha ea ka ea tlosoa. Ka kopo, leka hape.

source: Invalid SPORT, ARTS & CULTURE SECTION 80 COMMITTEE document
af_za: SPORT e sa lokelang, ARTS & CULTURE KAROLO EA 80 KOMITI ea komiti

source: The SPORT, ARTS & CULTURE SECTION 80 COMMITTEE document has been saved.
af_za: SPORT, ARTS & CULTURE KAROLO EA 80 Komiti ea Komiti e bolokiloe.

source: The SPORT, ARTS & CULTURE SECTION 80 COMMITTEE document could not be saved. Please, try again.
af_za: SPORT, ARTS & CULTURE KAROLO EA 80 Komiti ea Komiti e ke ke ea bolokeha. Ka kopo, leka hape.

source: The SPORT, ARTS & CULTURE SECTION 80 COMMITTEE document has been deleted.
af_za: SPORT, ARTS & CULTURE KAROLO EA 80 Komiti ea Komiti e tlosoa.

source: The SPORT, ARTS & CULTURE SECTION 80 COMMITTEE document could not be deleted. Please, try again.
af_za: SPORT, ARTS & CULTURE KAROLO EA 80 Komiti ea Komiti e ke ke ea tlosoa. Ka kopo, leka hape.

source: Invalid temporary committee
af_za: Komiti ea nakoana e sa lokelang

source: The temporary committee has been saved.
af_za: Komiti ea nakoana e bolokiloe.

source: The temporary committee could not be saved. Please, try again.
af_za: Komiti ea nakoana ha ea ka ea bolokeha. Ka kopo, leka hape.

source: The temporary committee has been deleted.
af_za: Komiti ea nakoana e tlosoa.

source: The temporary committee could not be deleted. Please, try again.
af_za: Komiti ea nakoana ha ea ka ea tlosoa. Ka kopo, leka hape.

source: Invalid Tourism, environ document
af_za: Bohahlauli bo sa lokelang, kopa lengolo

source: The Tourism, environ document has been saved.
af_za: Bohahlauli, moeling o ngotsoe o bolokiloe.

source: The Tourism, environ document could not be saved. Please, try again.
af_za: Bohahlauli, moqapi o se o sa bolokehe. Ka kopo, leka hape.

source: The Tourism, environ document has been deleted.
af_za: Bohahlauli, mohlomong tokomane e tlosoa.

source: The Tourism, environ document could not be deleted. Please, try again.
af_za: Bohahlauli, moqapi o ke ke oa tima. Ka kopo, leka hape.

source: Invalid username or password, try again
af_za: Lebitso la hau la mobu kapa password, leka hape

source: User permission have been set.
af_za: Letšolo la mosebedisi le behiloe.

source: The user could not be saved. Please, try again.
af_za: Moqapi ha aa ka a pholosoa. Ka kopo, leka hape.

source: The user has been saved.
af_za: Moqapi o bolokiloe.

source: The user details have been saved.
af_za: Lintlha tsa mosebedisi li bolokiloe.

source: The cellnumber on record
af_za: Cellnumber e ngotsoeng

source: The email address (
af_za: Aterese ea imeile (

source: The reset code (
af_za: Khoutu ea ho nchafatsa (

source: The confirm password does not match the first password.
af_za: Polelo e netefatsang ha e tsamaisane le password ea pele.

source: Your password has been reset successfully, please login.
af_za: Motlolo oa hau o sebelisitsoe ka katleho, ka kopo, kena.

source: The incident has been reported.
af_za: Ketsahalo e tlalehiloe.

source: The name of a folder can not begin with a period.
af_za: Lebitso la fensetere le ke ke la qala ka nako.

source: ADHOC COMMITTEE
af_za: Komiti ea ADHOC

source: Meeting name
af_za: Lebitso la kopano

source: Agenda
af_za: Kemiso

source: Previous meeting minutes
af_za: Metsotso e fetileng ea liboka

source: Items
af_za: Lintho

source: Annexures
af_za: Litlhaloso

source: Separate Covers
af_za: Khetholla Liaparo

source: Upload All Documents
af_za: Kenya All Documents

source: Add more documents to:
af_za: Kenya litokomane tse ling ho

source: Actions
af_za: Liketso

source: Delete
af_za: Tlosa

source: Are you sure you want to delete # %s?
af_za: Na u netefatsa hore u batla ho hlakola #% s?

source: List Mayco Documents
af_za: Thathamisa Mayco Documents

source: List Users
af_za: Sebelisa Basebelisi

source: New User
af_za: Mocha o Mocha

source: Submit
af_za: Romela

source: New Adhoc Committee
af_za: Komiti e ncha ea Adhoc

source: RESEND ADHOC COMMITTEE MESSAGES
af_za: TLISA MESEBETSI EA KOMITE EA ADHOC

source: Message Type (<small>Tick either one or both</small>)
af_za: Mofuta oa Molaetsa (<small> Tšoaea e le 'ngoe kapa ka bobeli </ small>)

source: Send Messages
af_za: Romela Melaetsa

source: AGENDA
af_za: LITABA

source: There is currently no agenda documents
af_za: Hona joale ha ho na litokomane tsa marang-rang

source: PREVIOUS MEETING MINUTES
af_za: MESEBETSI EA MOKHATLO OA MAHOLO
